[
  {
    "id": "caspian_ddb62da9",
    "name": "Aash-e Anar",
    "description": "Pomegranate soup with meatballs",
    "ingredients": [
      "1 bunch fresh parsley, thick stems removed and finely chopped",
      "1 bunch fresh cilantro, thick stems removed and finely chopped",
      "1/2 cup fresh mint, finely chopped",
      "1/2 cup garlic chives or Persian Tarreh, finely chopped",
      "1/4 cup fresh tarragon, finely chopped",
      "1/2 cup  yellow split peas",
      "3 cups  water",
      "1 pound ground beef, or lamb or turkey",
      "1/2 cup sabzi mixture (herbs)",
      "1/2 teaspoon salt",
      "1/2 teaspoon pepper,  ground",
      "1/4 teaspoon turmeric, ground",
      "2 cloves garlic, minced",
      "2 tablespoons olive oil",
      "1 large onion, diced",
      "4 tablespoons olive oil, more as needed",
      "4 cloves garlic, minced",
      "1/2 teaspoon turmeric, ground",
      "1/2 teaspoon salt, adjust to your taste",
      "1/4 teaspoon pepper,  ground",
      "1/2 cup rice",
      "4 cups pomegranate juice",
      "2 cups broth or water, adjust as needed",
      "2 tablespoons pomegranate molasses",
      "4 tablespoons pomegranate seeds",
      "1 teaspoon Golpar (Persian hog weed), ground (optional)"
    ],
    "steps": [
      "Chop all the herbs by hand or in in the food processor and set aside.",
      "Place the yellow split peas and water in a medium sized sauce pan and bring to a gentle boil, uncovered.",
      "Lower the flame, cover and gently simmer for about 15-20 minutes or until the yellow split peas have softened, but are not fully cooked.  Keep an eye on on the yellow split peas as they tend to foam.",
      "Strain and set aside.",
      "Add all the ingredients for the meatballs in a large mixing bowl with the exception of the oil.",
      "Thoroughly mix the meatball ingredients and make meatballs the size of small walnuts.",
      "Place the oil in a large frying pan and saute the meatballs over medium heat for about 10 minutes.  The meatballs should be lightly browned and have become quite aromatic.   Set aside.",
      "In a large pot, saute the onions with olive oil over medium heat for about 10 minutes or until the onions are lightly browned.",
      "Add garlic and turmeric continue to saute for 2 additional minutes.",
      "Add the chopped herbs and saute on medium heat for 5-7 minutes.  The herbs should turn from bright green to a darker green color.  If the herbs are sticking to the bottom of the pan, add a touch more oil.",
      "Add the remining ingredients along with the partially cooked yellow split peas and bring to a gentle boil.",
      "Cover and cook on low heat for 30 minutes.",
      "Add the meatballs and continue to cook on low heat and covered for another 30 minutes.",
      "Check for flavor and consistency.  The Aash should be pleasantly tart with some elements of sweetness and the consistency should be that of a thick soup.",
      "Pour the mixture into a serving bowl and garnish with pomegranate seeds and Golpar."
    ],
    "minutes": 20,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Soup",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2020/12/31/aash-e-anar-pomegranate-soup-with-meatballs/"
  },
  {
    "id": "caspian_6ac115bc",
    "name": "Aash-e Mash",
    "description": "Mung beans and fresh herbs soup",
    "ingredients": [
      "1 large onion, diced",
      "4 tablespoons olive oil",
      "1 teaspoon turmeric, ground",
      "2 medium turnips, diced into 1/2 inch cubes",
      "1 cup mung beans, dried",
      "9 cups water or broth",
      "1/2 cup white rice",
      "1 1/2 teaspoons salt, adjust as necessary",
      "1/2 teaspoon black pepper, ground",
      "2 bunches fresh dill,   about 1 cup, roughly chopped",
      "1 medium leek, finely chopped. Or 6 tablespoons dried Persian Tarreh (leeks)",
      "1/2 cup fresh tarragon, roughly chopped. Or 3 tablespoons dried",
      "1/2 cup fresh savory, roughly chopped. Or 3 tablespoons dried",
      "2-4 tablespoons Kashk, Persian prepared liquid whey",
      "4 tablespoons olive oil",
      "1 medium onion, thinly sliced",
      "1 pinch salt",
      "2 tablespoons olive oil",
      "6 cloves garlic, thinly sliced",
      "4 tablespoons olive oil",
      "1 tablespoon dried Persian mint"
    ],
    "steps": [
      "In a large pot saute the onion with the olive oil for about 10 minutes or until lightly golden.",
      "Add turmeric and turnips and toss around for a couple of minutes for the turnip to become golden.",
      "Add the mung beans and the water or stock, and bring to a gentle boil.  Lower the flame, cover and cook for 15 minutes.",
      "Add the remaining ingredients, bring back to a boil.  Cover and simmer on low heat for 45 minutes or until the mung beans are fully cooked and have softened.  The soup texture should be dense with ingredients with just a little broth.  Adjust consistency as necessary by adding water or cooking more without a lid.",
      "While the Aash is cooking, prepare the toppings",
      "In a medium sized frying pan, saute the onions with olive oil for 15 minutes over low heat until they are golden in color. Add salt, stir and remove from the pan.",
      "In a small saucepan, heat the olive oil and begin sauteing the garlic over low flame for 2-3 minutes or until golden brown. Take extra care not to burn the garlic. Remove from the pan and set aside.",
      "In the same saucepan, heat the olive oil and add the mint and saute on low heat for 30 seconds. Remove from the pan and set aside.",
      "Serve the Aash in a soup bowl and decorate the Aash with Kashk, onions, garlic and mint."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Soup",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2021/01/07/aash-e-mash-mung-beans-and-herbs-soup/"
  },
  {
    "id": "caspian_2c3aeea7",
    "name": "Kashk Bademjoon",
    "description": "Eggplant spread with whey, mint and caramelized onions",
    "ingredients": [
      "4 tablespoons olive oil",
      "1 large onion, thinly sliced",
      "1/2 teaspoon salt",
      "6 tablespoons olive oil, more as needed",
      "4 Asian eggplants, or 2 Italian, approximately 1.5 pounds,  peeled and halved or quartered depending on the size",
      "4 cloves garlic, minced",
      "1  teaspoon salt, divided",
      "1/2 teaspoon pepper, ground",
      "1/2 teaspoon turmeric,  ground",
      "1 tablespoon dried mint leaves",
      "1/2 cup water",
      "1/2 cup kashk, adjust as needed",
      "2 tablespoons olive oil",
      "2 cloves garlic,  thinly sliced",
      "1 tablespoon dried mint leaves",
      "2 tablespoons Kashk, mixed with 2 tablespoons water",
      "2 tablespoons caramelized onions",
      "1 tablespoon ground walnuts, optional",
      "4 pieces dates,  cut in pieces, optional"
    ],
    "steps": [
      "In a large frying pan, saute the onions in 4 tablespoons of oil over medium heat for 15 minutes or until golden brown.  Add 1/2 teaspoon of salt, stir and remove from the pan and set aside.",
      "In the same pan add 4 tablespoons of oil and saute the eggplants over medium-low heat for 10-15 minutes.  Be sure to turn the eggplants over once and check to make sure they are browning nicely without burning.",
      "Eggplants tend to soak up the oil, so adjust as needed before adding the next ingredients.",
      "Add garlic, the remaining 1/2 teaspoon salt, pepper, turmeric, and dried mint leaves.  Toss and continue to saute for 2 minutes.",
      "Add most of the previously caramelized onions and water to the eggplant mixture.  Be sure to reserve 2 tablespoons of caramelized onions for the garnish.",
      "Cover, lower the flame and cook for 15-20 minutes or until the eggplants are completely cooked and softened.",
      "Using a potato masher or a hand held blender, mash as much of the eggplant mixture as you would like to create either a smooth or chunky texture depending on your preference.",
      "Add the Kashk, stir and adjust the seasoning as needed.",
      "In a small frying pan saute the garlic slices in olive oil for 2-3 minutes over medium flame or until lightly golden and aromatic.  Remove from the pan and set aside.",
      "To the same pan add the dried mint and saute over medium heat for 2 minutes.",
      "Place the eggplant spread on a serving platter and drizzle the Kashk and water mixture decoratively on top.",
      "Garnish with the 2 tablespoons of previously caramelized onion, fried garlic and mint.",
      "Decoratively garnish with the ground walnuts and dates, if using.",
      "Serve with Persian flat bread."
    ],
    "minutes": 20,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Soup",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2020/03/16/kashk-bademjoon-eggplant-spread-with-whey-and-mint/"
  },
  {
    "id": "caspian_df752ed5",
    "name": "Mirza Ghasemi",
    "description": "Fire roasted eggplant spread with eggs",
    "ingredients": [
      "4 Italian eggplants, medium sized",
      "6 tablespoons olive oil",
      "1 large shallot diced",
      "8  cloves garlic, minced",
      "2 teaspoons salt, adjust to your taste",
      "1/2 teaspoon pepper, ground",
      "1 teaspoon turmeric, ground",
      "6 ripe tomatoes, diced",
      "4 eggs",
      "4 tablespoons fresh basil leaves"
    ],
    "steps": [
      "Roast the eggplants over an open flame on the stovetop or on the grill until all sides are completely blackened, and the center begins to soften about 15-20 minutes.",
      "Alternatively, they can be broiled or roasted in a high-temperature oven, though they will not have the smokey flavor that is typically associated with this dish.  Be sure to poke the eggplants with a fork so that the steam has a way to exit and prevent them from bursting.",
      "Once cooled to room temperature, remove the charred skin and roughly chop the eggplants.  Set aside.",
      "In the meantime, saute the diced shallots in olive oil in a large skillet over medium-low heat for 10 minutes or until they are lightly golden.",
      "Add garlic, salt, pepper, and turmeric, and saute for an additional 2 minutes.",
      "Add the chopped eggplants and tomatoes, stir, cover, and cook for 15-20 minutes over low heat.",
      "Using a spoon, pull back some of the eggplants to make space to crack an egg in.  Continue until all the eggs have been cracked into the pan.",
      "Cover and cook for about 5 minutes over low heat.  The eggs should be cooked, but somewhat soft and runny.",
      "Alternatively, the eggs can be mixed into the eggplant mixture to create a uniform consistency.",
      "Add chopped fresh basil on top and serve with your favorite Persian flatbread."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/03/07/smoked-eggplant-spread-with-poached-eggs/"
  },
  {
    "id": "caspian_7b702344",
    "name": "Zeitoon Parvardeh",
    "description": "Olive tapenade with pomegranate",
    "ingredients": [
      "2 cup green olives, pitted, divided",
      "4 tablespoons olive oil, more for drizzling over the spread",
      "1 cup walnuts",
      "1/2 cup fresh mint",
      "1/2 cup fresh basil",
      "6 cloves garlic",
      "1 teaspoon salt",
      "1/2 teaspoon Golpar (Persian hogweed), powder",
      "4-6 tablespoons pomegranate molasses",
      "1 lime, juiced",
      "2 tablespoons olive oil",
      "1/2 cup pomegranate arils",
      "1 sprig fresh mint or basil leaf"
    ],
    "steps": [
      "Combine 1/2 cup of olives and the remaining ingredients in a food processor and process until you have a coarsely textured mixture.",
      "Remove the mixture and place in a mixing bowl, and fold in the remaining 1 1/2 cup of olives.",
      "Place the olive mixture in a serving bowl, drizzle with olive oil and decoratively garnish with the pomegranate arils and fresh herbs.",
      "Serve with your favorite bread or crackers."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/03/05/persian-olive-tapenade-with-pomegranate/"
  },
  {
    "id": "caspian_e37292f4",
    "name": "Sharbat Khakshir",
    "description": "Teff and saffron cordial",
    "ingredients": [
      "2 tablespoons khakshir seeds",
      "2 tablespoons unrefined cane sugar, or honey. Adjust to your taste.",
      "4 tablespoons  hot water",
      "1/4 teaspoon saffron threads,  ground and bloomed with 1 tablespoon hot water"
    ],
    "steps": [
      "Place the khakshir seeds in water and let them soak for about 30 minutes. After soaking, carefully drain the water, removing any floating seeds or plant matter.",
      "Dissolve the sugar in hot water, then set it aside.",
      "Choose two decorative glasses and fill each with plenty of ice. Divide the soaked khakshir seeds, sugar water, and saffron water evenly between the two glasses.",
      "Top off each glass with cool water.",
      "Stir well and enjoy your refreshing drink!"
    ],
    "minutes": 30,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2024/08/29/sharbat-khakshir-teff-and-saffron-cordial/"
  },
  {
    "id": "caspian_bb3d03cb",
    "name": "Tokhm-e Sharbatie",
    "description": "A tart and sweet aromatic basil seeds beverage infused with rose water and lime juice.",
    "ingredients": [
      "2 tablespoons basil seeds",
      "24 ounces water",
      "6 tablespoons sugar",
      "3 fresh limes, juiced",
      "5 tablespoons rose water",
      "4 fresh mint leaves, for garnishing"
    ],
    "steps": [
      "Bring 8 oz of water to a near boil and dissolve the sugar.",
      "Add the remaining 16 oz of cool water, and the basil seeds.",
      "Stir and place in the refrigerator for an hour.",
      "Pour in the fresh lime juice and rose water and stir.",
      "Fill glasses with ice and pour the Sharbat over the ice.",
      "Garnish with a slice of fresh lime and a mint leaf and serve."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/02/01/tokhm-e-sharbatie/"
  },
  {
    "id": "caspian_a4cadbc2",
    "name": "Lavash flatbread",
    "description": "Last weekend I celebrated Sizdeh Bedar, the 13th day of Nowruz (Persian New Year) with friends. As is traditional in Iran, we headed outdoors for a picnic and the ceremonial release of Sabzeh (sproute",
    "ingredients": [
      "1 teaspoon yeast",
      "1/2 teaspoon sugar",
      "1 cup plus 1 tablespoon lukewarm water",
      "2 cups all-purpose flour",
      "1 cup whole wheat flour",
      "1 teaspoon sea salt"
    ],
    "steps": [
      "Combine the yeast, sugar, and water in a medium-sized bowl, stir, and set aside for about 5 minutes to proof the yeast.",
      "In another medium-sized bowl, combine the all-purpose and whole wheat flour and salt and mix well.",
      "Once the yeast is proofed and visibly looks bubbly and foaming, gradually add the flour mixture into the yeast bowl and stir until a dough forms.",
      "Remove the dough from the bowl, place it on a lightly floured work surface, and knead for about 5 minutes until a smooth dough has formed.",
      "Dust a clean medium-sized bowl with flour and place the dough inside the bowl.",
      "Cover with a clean kitchen towel and set aside at room temperature to rise for 1 hour.",
      "The dough will have risen but not quite doubled in size at this point. Remove the dough from the bowl and divide into 6 equal pieces.",
      "Cup one hand around each dough ball and roll it on a dry surface, using the palm and sides of your hand in a circular motion to create a tight and smooth ball.",
      "Cover the dough with a towel to prevent it from drying out, then let it rest for 15 minutes. This will help the dough relax, making it easier to roll out.",
      "In the meantime, position a pizza stone on the lower rack and preheat the oven to 500°F.",
      "With a rolling pin,  roll out each dough until it is about 10-12 inches wide and notably thin.  It should remain easy to handle without tearing.",
      "Now, using both hands, gently lift the dough and carefully place it onto the preheated pizza stone in the oven. Take care to avoid tearing or creating excessive folds in the dough as you transfer it.",
      "Bubbles will quickly form across the surface of the flatbread dough, and it will only need to bake for about 2 minutes. Be careful not to overcook the lavash, as they can become dry and cracker-like.",
      "Take out the flatbread and transfer it to a platter. Cover it with a clean towel to maintain its moisture. Repeat this process with the remaining dough.",
      "For storage, cover them with a clean kitchen towel or place them in a sealed bag, then store them in a cool, dry place. Alternatively, you can freeze them for long-term storage."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Soup",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2024/04/02/lavash-flatbread/"
  },
  {
    "id": "caspian_d58a941e",
    "name": "Shirmal",
    "description": "Persian milk bread",
    "ingredients": [
      "3/4  cup whole milk, gently warmed",
      "1/3 cup unrefined cane sugar, adjust to your taste",
      "1 teaspoon yeast",
      "4 tablespoons unsalted butter, at room temperature",
      "1  egg yolk",
      "2 1/2 cups  *whole wheat pastry flour, sifted",
      "1 teaspoon  cardamom, ground",
      "1/8 teaspoon  salt",
      "1 egg yolk",
      "1/4  teaspoon  saffron threads, ground and mixed with 1 tablespoon hot water",
      "1 teaspoon sesame seeds"
    ],
    "steps": [
      "In a small mixing bowl, combine the milk, 1 teaspoon of sugar, and the yeast. Stir the mixture and set it aside until the yeast activates and becomes slightly foamy.",
      "In a separate large mixing bowl, whisk together the remaining sugar and butter until creamy. Once they’re nicely blended, add the egg and keep mixing until everything is well combined.",
      "Pour in the milk and yeast mixture, and give it a good whisk until everything is well combined.",
      "Sprinkle in the cardamom and salt and slowly add the flour, stirring with a spatula or your hands as you go until a dough forms. Add as much of the flour as necessary to achieve a dough that is slightly tacky and sticky to the touch, which helps keep it light when baked.",
      "Once it's ready, remove the dough from the bowl and place it on a lightly floured surface. Knead for about 10 minutes, working diligently and with care. Try to resist adding extra flour to the dough.",
      "Lightly grease the bowl with a neutral oil, then place the dough inside, turning it to ensure all sides are lightly coated. Cover the bowl with a kitchen towel and let the dough rise at room temperature until it doubles in size, about an hour.",
      "Now remove the supple dough out of the bowl, punch the air out and knead it again for a couple of minutes, before dividing it into half.  Using a rolling pin, roll each half out to a 8-9 inch disc and transfer to a baking sheet lined with a parchment paper.",
      "Gently score the dough with a sharp knife or dough scraper, making shallow diagonal lines about 1 inch apart. Once you’ve done that, give the dough a little rotate and score it again in the opposite direction to create a crisscross pattern.",
      "Cover with a kitchen towel and allow to rest for 30 minutes.",
      "Preheat your oven to 365°F.",
      "In a small mixing bowl, combine the egg yolk with the saffron water and mix it well. Then, use a brush to lightly and evenly glaze the top of the dough. Finish by sprinkling with sesame seeds.",
      "Place the baking sheet in the oven and bake until the dough has risen and the top is a lovely golden color, about 20 minutes. Once it's done, take it out of the oven and let it cool. Store it in an airtight container at room temperature for up to 5 days."
    ],
    "minutes": 30,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2024/08/22/shirmal-persian-milk-bread/"
  },
  {
    "id": "caspian_1d705c4d",
    "name": "Baghlava",
    "description": "Persian Baklava with rose water and cardamom",
    "ingredients": [
      "2 cups sugar",
      "2/3 cup water",
      "1/4 cup unsalted butter",
      "1/4 teaspoon salt",
      "1 cup rose water or orange blossom water",
      "4 cups ground almonds, or walnuts or pistachios",
      "2 cups unrefined sugar",
      "2 tablespoon ground cardamom",
      "1 package Filo dough, at room temperature",
      "1/2 cup butter, gently melted for brushing the filo dough"
    ],
    "steps": [
      "Combine the sugar, water, butter and salt and heat until sugar is dissolved and it is near boiling. Remove from the heat, add rose water and set aside.",
      "In a food processor blend the almonds, sugar, and cardamom and pulse until you have a reasonably fine ground.",
      "Prepare the 18 X 13 baking sheet by lightly brushing it with melted butter.",
      "Begin by putting one sheet of filo dough on the greased sheet, brush with butter and repeat until you have 7 sheets stacked up.",
      "Spread 1/2 of the ground almonds mixture on top and repeat with 6 more sheets of filo dough, brushing every sheet with butter.",
      "Add the remaining almond mixture and continue to layer the remaining 7 sheets of filo dough, burshing every sheet with butter.",
      "With a sharp knife cut the baklava into 1-inch diamond shapes. (see diagram)",
      "Pour half of the syrup over the cut baklava and bake at 350°F for about 30-35 minutes or until the filo dough has turned golden and crisp.",
      "Remove from the oven and immediately pour the other half of the syrup and allow to rest for at least 2 hours.",
      "Carefully remove the pieces from the pan and place on a serving platter.",
      "Persian baklava can be served with black tea or coffee."
    ],
    "minutes": 30,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "http://thecaspianchef.com/2018/11/24/persian-baklava-baghlava-%d8%a8%d8%a7%d9%82%d9%84%d9%88%d8%a7/"
  },
  {
    "id": "caspian_8a68bbd8",
    "name": "Bamieh",
    "description": "bite-sized \"donuts\" soaked in saffron-rosewater syrup",
    "ingredients": [
      "1 cup sugar",
      "1/2 cup water",
      "1 tablespoon lemon juice",
      "2 tablespoons rose water",
      "1/4 teaspoon saffron threads, ground into a powder and mixed with 1 tablespoon hot water",
      "1/2 cup water",
      "2 tablespoons butter",
      "1/8 teaspoon salt",
      "1/2 cup all-purpose flour, sifted",
      "1 tablespoon saffron syrup, from above",
      "1 large egg, lightly beaten",
      "3-4 cups Neutral oil for frying"
    ],
    "steps": [
      "Place the sugar into a medium-sized stainless steel saucepan. Slowly add the water and lemon juice, then bring it to a gentle simmer over medium heat.",
      "Gently stir the mixture once with a wooden spatula, then refrain from stirring further. As the syrup begins to bubble and the sugar dissolves, reduce the heat to low and allow the syrup to thicken slightly, about 10 minutes.",
      "Add the saffron water and rose water, simmer for an additional minute, then remove from heat and set the pan aside. The mixture should have a consistency similar to room-temperature maple syrup.",
      "Select another medium-sized saucepan and combine the water, butter, salt, and 1 tablespoon of saffron syrup. Heat over medium heat until it reaches a gentle simmer, about 3-4 minutes.",
      "Reduce the heat to low, then add all the flour at once. Stir vigorously with a sturdy rubber spatula to incorporate the flour into the mixture. Continue stirring, folding, and stretching the dough until it becomes completely smooth and pliable, about 5 minutes.",
      "Transfer the dough from the pan to a medium-sized mixing bowl, spreading it out to cool. Allow the dough to rest for approximately 10 minutes.",
      "Once the dough has cooled, add the egg and mix with an electric hand mixer (or a sturdy rubber spatula) until the egg is integrated into the dough. Take your time, as this will take a few minutes. The dough will be soft and quite sticky at the end.",
      "Transfer the dough into a piping bag equipped with a star-shaped tip and set aside.",
      "Choose a large frying pan and pour in enough oil to cover the bottom by 1 to 2 inches. Remember not to turn on the heat just yet! Dip a pair of kitchen shears into the oil to make sure the blades are coated.",
      "Hold the piping bag in one hand and a pair of shears in the other over the frying pan. Begin squeezing the dough directly into the room-temperature oil, cutting it into 1-inch segments. Avoid mixing or disturbing the pieces at this stage.",
      "After placing all the dough pieces in the oil, set the heat to medium-low. Once the oil starts bubbling around the edges of the bamieh, reduce the heat to low. The pieces will float after 8-10 minutes, indicating they’re ready for gentle rotation to ensure even cooking and browning on both sides. Keep this process going for a total of 20-25 minutes.",
      "Meanwhile, return the saucepan with the syrup to the burner and heat it briefly over low heat until it reaches a consistency similar to maple syrup.",
      "Once the Bamieh pieces have turned a rich golden brown color, remove them from the oil using a slotted spoon or a spider strainer and transfer them to the saucepan with the syrup. Gently toss the pieces to coat them thoroughly with the syrup, and allow them to soak for about a minute.",
      "Using a slotted spoon, transfer the Bamieh pieces onto a cooling rack or another strainer. Let any extra syrup drip off for a few minutes. Then, transfer the bamieh to a serving platter and sprinkle ground pistachios on top for garnish.",
      "Store the Bamieh in an airtight container at room temperature."
    ],
    "minutes": 30,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2024/03/15/bamieh-bite-sized-donuts-soaked-in-saffron-rosewater-syrup/"
  },
  {
    "id": "caspian_830d656e",
    "name": "Cayk-e Eshgh",
    "description": "Persian love cake. A buttery moist cake with cardamom, rose water and citrus.",
    "ingredients": [
      "8 tablespoons butter,  at room temperature",
      "2/3 cup unrefined sugar",
      "2 large eggs,  at room temperature",
      "4 tablespoons rose water",
      "3  tablespoons lemon juice,  fresh",
      "3-4 tablespoons water",
      "2 cups almond flour",
      "1/2 cup whole wheat pastry flour  (or all purpose)",
      "1 tablespoon cardamom",
      "2 teaspoons baking powder",
      "1/2 teaspoon baking soda",
      "1/4  teaspoon  salt",
      "1 1/2 cups powdered sugar,  sifted",
      "1  tablespoon  rose water",
      "1  tablespoon  lemon juice,  fresh",
      "1-2 tablespoons Rose petals",
      "3 tablespoons pistachios,  chopped"
    ],
    "steps": [
      "Set the oven to 350°F and place the oven rack in the center position.",
      "Lightly spread a small amount of butter all around an 8-inch cake pan, covering the bottom and all the sides.  Sprinkle a small amount of flour into the pan and tap the pan while tilting it to make sure the flour has covered the greased surface.  Turn the pan upside down and tap out any excess flour.  I prefer this method to lining with parchment paper.",
      "In a large mixing bowl, mix the room temperature butter and sugar using a spatula until you have a well-mixed paste.",
      "Using a whisk, add one egg at a time and mix until the eggs are well incorporated.",
      "Add the rose water, lemon juice, and water and mix well.",
      "In a separate bowl add the all the remaining dry ingredients, making sure all the ingredients are well mixed.",
      "Slowly add the dry ingredients into the wet bowl, gently mixing as you go along.  I typically start mixing with a whisk and then finish with a spatula.",
      "Pour the batter into the greased and floured cake pan and gently smooth out the top surface and place in the oven.",
      "Bake for 30-35 minutes and test with a toothpick to make sure the batter is fully cooked in the center.",
      "Remove from the oven and allow to cool slightly before attempting to take the cake out of the pan.",
      "Using a butter knife, gently loosen the cake from its edges and gently flip the cake out to a plate and then flip again onto a cake platter so that the top of the cake is on top.",
      "It is necessary for the cake to be completely cooled before icing.",
      "In a small bowl add all the icing ingredients and mix well.  Once the cake is cooled, drizzle or spread the icing over the top and garnish with pistachios and rose petals."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/02/21/kayk-e-eshgh/"
  },
  {
    "id": "caspian_00a762cb",
    "name": "Cake Yazdi",
    "description": "Cardamom and rosewater cupcakes",
    "ingredients": [
      "2 1/2 cups whole wheat pastry flour, (300 g) or all purpose",
      "2 teaspoons cardamom,  ground",
      "2  teaspoons baking powder",
      "1/4 teaspoon baking soda",
      "1/4 teaspoon salt",
      "2 eggs",
      "1 cup sugar, (200 g)",
      "1 cup plain yogurt, (245 g) whole fat",
      "4 tablespoons rose water",
      "1/4 teaspoon saffron,  ground and dissolved in 3 tablespoons of hot water",
      "1/2 cup unsalted butter,  (113 g) gently melted",
      "1 tablespoon pistachios, chopped finely",
      "1 teaspoon rose petals (optional)"
    ],
    "steps": [
      "Preheat oven to 375° F / 190° C.",
      "Gently grease the muffin tins or use cupcake liners.",
      "In a large bowl, mix together the flour, cardamom, baking powder, baking soda and salt.",
      "In another bowl, whisk together the remaining ingredients.",
      "Fold the wet mixture into the dry mixture and stir until just combined.  Do not overmix.",
      "Evenly fill the muffin tin or liners with the batter and bake for about 25 to 30 minutes, or until muffins are golden brown and a toothpick test comes out clean.",
      "Remove from the oven and place on a serving platter and sprinkle the topping while hot.",
      "Store in an airtight container."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2020/01/31/kayk-yazdi-cardamom-and-rosewater-cupcakes/"
  },
  {
    "id": "caspian_ede73a0d",
    "name": "Faloodeh",
    "description": "Lime and rosewater granita with rice noodles",
    "ingredients": [
      "3 cups water",
      "1 cup sugar",
      "1/8 teaspoon fine sea salt",
      "2 tablespoons fresh lime juice",
      "2 tablespoons rosewater",
      "5 cups of water",
      "2 ounces thin rice noodles",
      "1 wedge fresh lime",
      "1 tablespoon Slivered pistachios optional",
      "1 tablespoons Sour cherry syrup or sour cherry jam optional"
    ],
    "steps": [
      "Combine the water, sugar, and salt in a medium-sized saucepan and bring to a gentle simmer. Reduce the heat and stir for a couple of minutes or until the sugar is fully dissolved.",
      "Remove from the heat, add the lime juice and rosewater to the syrup and transfer it to a shallow freezer-safe glass or metal dish, and place in the freezer, uncovered for 30 minutes.",
      "Prepare the noodles by bringing the water to a boil in a medium-sized pot. Add the rice noodles and continue to boil on medium-high heat, uncovered for 2 minutes.",
      "Turn the heat off, cover, and allow to sit for 5 minutes. The time may vary depending on the type of rice or vermicelli noodles. The noodles should be soft at this stage but still hold their shape.",
      "Strain the noodles through a fine-mesh strainer,  rinse with cold water and allow to drip dry. Using kitchen scissors or a knife, cut the noodles into 1 inch pieces and set them aside.",
      "Remove the partially cooled syrup from the freezer after the initial 30 minutes, add the noodles and mix well. Place the noodles and syrup back in the freezer for one hour, uncovered.",
      "Remove the noodles from the freezer, and using a fork, begin scraping the frozen parts from the sides of the dish and mixing them back to the center. Place the noodles back in the freezer for another hour before repeating the scraping and stirring.",
      "Repeat one last time. At this stage, the noodles should be crispy and the syrup should have turned into a slushy semi-frozen granita texture.",
      "To serve, scrape the noodles with a fork and place them into an individual serving bowl along with a wedge of fresh lime.",
      "Top the Faloodeh with your choice of topping."
    ],
    "minutes": 5,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2022/04/30/faloodeh-lime-and-rosewater-granita-with-rice-noodles/"
  },
  {
    "id": "caspian_b21f52c0",
    "name": "Naan-e Berenji",
    "description": "These cookies are quite delicate and brittle and packed with familiar flavors and aroma of cardamom and roses.",
    "ingredients": [
      "1 cup confectioner's sugar",
      "1 large egg yolk",
      "7 tablespoons butter, room temperature",
      "1 1/2 cup white rice flour",
      "1 pinch salt",
      "1 teaspoon cardamom",
      "2 tablespoons rosewater",
      "1 tablespoon poppy seeds"
    ],
    "steps": [
      "Preheat the oven to 300 degrees F and line a baking sheet with parchment paper.",
      "In a food processor, combine the confectioner’s sugar, egg yolk and butter and mix for a few seconds until creamy and smooth.",
      "Continue by adding the flour, salt, cardamom, and rose water and mix for about 30 seconds or until you have a smooth dough.",
      "Remove from the food processor and place in a bowl.",
      "You can roll out the dough (1/2 inch thick) on a lightly floured surface and use a very small (1 inch) round cookie cutter to cut out the cookies. OR, using a tablespoon measure, pull out a small amount of dough and using your hands turn the dough into a small round disc and place it on the baking sheet.",
      "Keep the cookies about an inch apart. The number of cookies will depend on the size of the cookies you created.",
      "Press each cookie down to make sure they are flat, and using a fork make indentations on the cookies (much like traditional peanut butter cookies).",
      "Sprinkle the poppy seeds over the cookies.",
      "Bake in the oven for up to 15 minutes, depending on the size of the cookies.",
      "Caution:  These cookies are quite brittle and crumbly when they come out of the oven.  Remove from the oven, and leave on the cookie sheet until entirely cooled.",
      "Once cooled, remove from the baking pan and keep them in an airtight container and refrigerate for freshness."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/05/01/rice-flour-cookies-with-poppy-seeds-pistachios-and-rosewater/"
  },
  {
    "id": "caspian_8fc88dca",
    "name": "Naan-e Keshmeshi",
    "description": "Rosewater and raisin cookies",
    "ingredients": [
      "2 sticks unsalted butter, softened at room temperature",
      "1 teaspoon vanilla extract",
      "2 tablespoons rose water",
      "1/4 teaspoon salt",
      "1 cup sugar",
      "3 large eggs",
      "1 cup raisins",
      "2 cups whole wheat pastry flour, or all purpose"
    ],
    "steps": [
      "Place an oven rack in the center of the oven, and preheat the oven to 375°F.",
      "Line several cookie sheets with parchment paper or baking mats.",
      "In a large mixing bowl, vigorously whisk together the butter, vanilla, rose water, salt, and sugar until smooth.",
      "Then whisk in the eggs one at a time. Stir until the mixture is creamy.",
      "Stir in the raisins and fold in the flour using a rubber spatula until a thick batter forms.",
      "Use a small ice cream scoop, spoon, or measure to pick up about 1 tablespoon of the batter at a time.  Place the scoops on the lined cookie sheets, leaving about 2-3 inches between each scoop.",
      "Bake for 10-12 minutes or until the edges of the cookies are golden brown.",
      "Remove cookie sheets from the oven and place on cooling racks. When cool, loosen and remove the cookies from the parchment paper with a spatula.",
      "Transfer the raisin cookies to a serving platter. To store, place them in an airtight container and refrigerate until ready to serve."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/09/01/rosewater-and-raisin-cookies/"
  },
  {
    "id": "caspian_3bdc5794",
    "name": "Naan Nokhodchi",
    "description": "Cardamom chickpea cookies",
    "ingredients": [
      "1/2 cup powdered sugar, sifted (50 g)",
      "1 tiny pinch salt",
      "7 tablespoons ghee, room temperature (50 g)",
      "1 teaspoon cardamom,  ground",
      "1 teaspoon rosewater",
      "1 cup roasted chickpea flour, sifted (100 g)"
    ],
    "steps": [
      "In a medium-sized mixing bowl combine the powdered sugar, salt, ghee, cardamom and rosewater.",
      "Using a rubber spatula, mix all the ingredients until they are fully combined.",
      "Add the chickpea (garbanzo) flour and begin mixing using your hands. The mixture will  be dry and crumbly to start with, but continue to knead and squeeze the dough, and the heat of your hands will allow the ghee and flour to come together. This step can take up to 5 minutes.",
      "Flatten the dough into a 1/2 inch thick square and wrap with Saran wrap. Rest at room temperature for 30 minutes.",
      "After the dough has rested, remove from the Saran wrap and place on the counter.  Make sure that the top surface of the cookie dough is flat, using your hands or a small rolling pin if necessary.",
      "Select a small cookie cutter, typically less than an inch wide, and carefully cut out the cookies and place on a baking sheet lined with parchment paper. Keep in mind that these cookies are quite delicate, so extra care is needed.",
      "While these cookies won't rise or spread, be sure to leave about an inch of space between them to allow hot air to circulate.",
      "Bake at 300 degrees F for about 13-15 minutes, depending on the size of your cookies.",
      "Remove from the oven and allow to cool completely before attempting to remove them from the baking sheet, otherwise they may crumble.",
      "Using a small spatula carefully remove the cookies from the tray and place on  serving platter.",
      "These cookies have a  long shelf life, but do store them in an airtight container or place in the freezer for long term storage."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2023/03/04/naan-nokhodchi-cardamom-chickpea-cookies/"
  },
  {
    "id": "caspian_eca564c5",
    "name": "Cayk-e Golabi ba zaferoon",
    "description": "Persian pear and saffron cake with Seville orange and pistachios frosting",
    "ingredients": [
      "2 cups whole wheat pastry flour",
      "1/8 teaspoon salt",
      "2  teaspoons baking powder",
      "1/2 teaspoon baking soda",
      "1 cup sugar",
      "1/2 cup  oil, (sunflower or safflower)",
      "1 medium pear, grated (about a cup)",
      "1/4 teaspoon ground saffron, dissolved in 2 tablespoons hot water",
      "4 tablespoons fresh Seville orange juice (other varieties of orange will work too)",
      "1/4 cup water. (plus/minus 1 tablespoon)",
      "1 1/2 cups powdered sugar, sifted",
      "2 tablespoons fresh Seville orange juice (other varieties of orange will work too)",
      "1  tablespoon orange blossom water",
      "2 tablespoons pistachios,  slivered or roughly chopped"
    ],
    "steps": [
      "Preheat the oven to 375 degrees Fahrenheit.",
      "Select an 8 inch round cake pan and using a small amount of oil thoroughly grease the bottom and the edges of the cake pan.",
      "Lightly dust the pan with a tablespoon of flour and shake and tilt to have the flour spread out to every nook and cranny of the pan. Turn the pan upside down and tap out any extra flour. (I prefer this method to using a parchment paper.)",
      "In a medium sized bowl, combine the flour, salt, baking powder and baking soda and mix thoroughly.  Set aside.",
      "In a separate medium sized bowl, combine the sugar, oil, pear, saffron water and orange juice and water and mix well.",
      "Using a whisk, gently incorporate 1/3 of the flour mixture into the liquid mixture and stir into a batter in which no flour is visible.",
      "Switching to a spatula, gently combine another 1/3 of the flour mixture into the batter.",
      "Finally add the remainder of the flour to the batter and mix until all the flour has been incorporated.  Do not over mix!",
      "The consistency of the batter should resemble a thick pancake batter.  Adjust by adding a tablespoon of water at a time, if needed.",
      "Immediately place the pan in the oven on a center rack.  Remember this is a vegan cake and once you have mixed the wet and the dry ingredients and activated the leavening agents, it needs to go into the oven straight away!",
      "Set a timer for 10 minutes, do NOT open the oven door, and do not perform jumping jacks or burpees in front of your oven – they will make your cake collapse!",
      "After the initial 10 minutes, drop the temperature to 350 F and continue to bake for 25-30 additional minutes. Still no opening the oven door or vigorous exercise!",
      "The cake should have risen, formed some cracks on top and edges slightly pulled away from the pan.",
      "Test with a toothpick into the center of the cake and assess whether the cake is still wet in the center or completely baked.  If still wet, continue to bake for 5-8 additional minutes.",
      "Remove from the oven and set on a cooling rack until cool enough to handle with a light towel.",
      "Firmly tap the edges and bottom of the cake pan, and lightly shake it to begin loosening up the cake.  Use a  knife to go around the edges to help with the process.",
      "When you are certain that the cake is loosened, swiftly and carefully invert the cake onto a plate.  Place another plate on top of the upside-down cake and repeat so that the cake is standing right side up.",
      "While the cake cools, combine the sifted powdered sugar with orange juice and orange blossom water and mix well to ensure the frosting is smooth and not lumpy.",
      "Using a pastry spatula pour/spread the frosting on top of the cake.  You can have the frosting drizzled over the top or have it look tidy and smooth.",
      "Sprinkle the pistachios on top and serve with a hot cup of Persian tea."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/12/14/saffron-and-pear-cake-with-seville-orange-and-pistachio-frosting/"
  },
  {
    "id": "caspian_71fd4f2b",
    "name": "Sholeh Zard",
    "description": "Saffron, rosewater rice pudding",
    "ingredients": [
      "1 cup Basmati or Jasmine rice, rinsed",
      "8 cups water",
      "1/8 teaspoon salt",
      "2 cups sugar,  adjust to your taste",
      "4 tablespoons rosewater",
      "1/2 teaspoon ground saffron,  dissolved in 2 tablespoons hot water",
      "3 tablespoons butter",
      "1/2 cup slivered almonds",
      "1 tablespoon cinnamon, ground",
      "2 tablespoons pistachios, slivered",
      "2 tablespoons almonds,  slivered"
    ],
    "steps": [
      "In a large pot, combine 8 cups of water, the rinsed rice and salt and bring to a gentle boil, stirring occasionally.",
      "Once the rice mixture has come to a boil, lower the flame, partially cover, and cook for 60 minutes.  Be sure to stir occasionally to prevent the rice settling in the bottom.  Take extra care not to over mix.",
      "After 60 minutes, the rice should be soft and the mixture reasonably thick.",
      "Add the remaining ingredients,  gently stir and reduce the heat to low, cover and cook for another 30 minutes.",
      "At this stage the pudding should have a creamy and homogeneous substance without any excess liquid.  In the event there is excess liquid, continue to cook on low flame uncovered until the right texture has been achieved.  Keep in mind that the pudding will harden as it cools down.",
      "Place the Sholeh Zard in individual serving cups and garnish with ground cinnamon, slivered pistachios and almonds.",
      "Place in the refrigerator and serve chilled."
    ],
    "minutes": 5,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2020/10/10/sholeh-zard-saffron-and-rosewater-rice-pudding/"
  },
  {
    "id": "caspian_48a07a0f",
    "name": "Moraba-ye Beh",
    "description": "Quince jam with rose water",
    "ingredients": [
      "4 medium sized Quince, peeled and cut into 1-inch pieces",
      "1 1/2 cup water",
      "4 cups unrefined sugar",
      "2 cinnamon, sticks",
      "1/4  cup lemon juice, freshly squeezed",
      "2 tablespoons rose water",
      "1/2 teaspoon cardamom seeds",
      "1/4 teaspoon  allspice whole",
      "1/4 teaspoon cloves whole"
    ],
    "steps": [
      "Wash, dry, peel and cut quince into quarters.  Remove the seeds and the core and cut into 1-inch pieces.",
      "Place the quince in a pot and add water, cover and bring to a boil.  Once boiling, reduce the heat to low and continue to cook for 15 minutes.",
      "Add sugar, cinnamon sticks, the spice tea bag, and lemon juice and mix well.  Cover and continue to cook over low heat for 90 minutes.  Stirring gently from time to time.",
      "Add the rose water and continue to cook for an additional 15 minutes.  The syrup should have thickened by now and the quince will look a beautiful bright red color.",
      "Remove from heat and allow the jam to settle, about 10 minutes.",
      "Transfer the jam into pre-sterilized jars.",
      "You can store the jam in the refrigerator for about 3 weeks or 6 months in the freezer. Otherwise, proceed with your favorite canning process to keep the jam long-term."
    ],
    "minutes": 20,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/01/27/moraba-ye-beh/"
  },
  {
    "id": "caspian_c386cd8b",
    "name": "Moraba Havij",
    "description": "Carrot jam",
    "ingredients": [
      "8 average sized carrots, grated (peeling optional)",
      "2 1/2 cups water",
      "8 green cardamom pods,  lightly smashed",
      "1 lemon, juiced",
      "2 cups sugar, unrefined",
      "1/8 teaspoon salt",
      "2 tablespoons rose water",
      "1/4 teaspoon ground saffron, dissolved in 2 tablespoons water"
    ],
    "steps": [
      "Wash and dry the carrots before proceeding to grate them.  I always leave the skin on, but if you prefer, you can peel before grating them.",
      "Place the carrots, water, and cardamom pods in a large pot and bring the mixture to a gentle boil. You may want to put the cardamom pods in a teabag to make life easier when it is time to remove them from the jam.",
      "Once the mixture has come to a boil, reduce the heat, cover, and simmer for 15 minutes.",
      "Add the fresh lemon juice, sugar, and salt and continue to simmer on low heat covered for another 75 minutes.",
      "At this point, check to make sure there is plenty of syrup still left in the pot.  Adjust by adding a little bit more water if necessary.",
      "Add the rosewater and saffron water at the end to preserve their delicate flavors.  Simmer for 5 minutes.",
      "Turn off the heat and allow the jam to settle while you remove the cardamom pods.",
      "Transfer the jam into pre-sterilized jars.",
      "You can store the jam in the refrigerator for about 3 weeks, or about 6 months in the freezer. Otherwise, proceed with your favorite canning process to store the jam long-term."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2021/05/07/moraba-havij-carrot-jam/"
  },
  {
    "id": "caspian_ff603b94",
    "name": "Moraba Rivas",
    "description": "Rhubarb jam",
    "ingredients": [
      "6 cups chopped rhubarb, cut into 1 inch pieces",
      "2 cups sugar",
      "1 tablespoon lemon juice, freshly squeezed",
      "1 tablesoon rosewater",
      "1/8 teaspoon salt"
    ],
    "steps": [
      "Place the rhubarb and sugar in a non-reactive bowl (glass or wood, rather than metal), cover and place in the refrigerator for at least 8 hours.",
      "Be sure to stir it a couple of times to help with extracting the liquid from the rhubarb.",
      "Place the macerated rhubarb along with the remainder of the ingredients into a large stainless steel pot.",
      "Cover and cook on medium heat until the mixture begins to simmer, about 15-20 mins. Stir frequently.",
      "Reduce heat and continue to simmer for another 10 minutes.  The mixture should be nice and bubbly and slightly thickened.",
      "Remove from heat and allow the jam to settle, about 10 minutes.",
      "Transfer the jam into pre-sterilized jars.",
      "You can store the jam in the refrigerator for about 3 weeks, or about 6 months in the freezer. Otherwise, proceed with your favorite canning process to store the jam long-term."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2021/06/07/moraba-rivas-rhubarb-jam/"
  },
  {
    "id": "caspian_4c2d30c1",
    "name": "Kabob Barg",
    "description": "Filet mignon kebabs",
    "ingredients": [
      "1 large onion",
      "2 tablespoons olive oil",
      "4 tablespoons fresh lime juice",
      "1 1/2 teaspoons salt",
      "1/2 teaspoon black pepper, ground",
      "1/4 teaspoon ground saffron, mixed with 1 tablespoon of water",
      "2 pounds filet mignon"
    ],
    "steps": [
      "Grate the onion using a food processor or a hand grater.  Place the onion in a fine mesh strainer over a mixing bowl and squeeze out all the juice from the onion. Discard the pulp.",
      "Add the remaining ingredients except the meat, and mix well to form the marinade. Set aside.",
      "Place the filet mignon on a cutting board and using a sharp knife cut it into equal size pieces, each about 3-4 inches long. You will likely have about 6 pieces.",
      "Carefully begin to butterfly the first piece by making 2 horizontal cuts from opposite sides. The first cut should be one third of the way down from the top, and should extend about three quarters of the way across the piece. Be sure not to cut all the way through.",
      "Flip the piece over and make the second horizontal cut from the opposite side to the first cut. This should again be one third of the way down from the top, extending about three quarters of the way across the piece. At the end, the filet piece will be in the shape of an S, which when flipped open will be about one third of its original thickness.",
      "Butterfly the remaining filet pieces in the same way.",
      "Using the blunt edge of your knife (with the cutting edge pointing up), begin tenderizing the meat by pounding the knife all the way across each butterflied filet piece. While you don't want to push all the way through the meat, you do want to exert enough force to properly tenderize it. The meat should be about half its original thickness after this process.",
      "Place the tenderized filet pieces in a shallow pan, and pour the marinade over them.",
      "Cover, and refrigerate for at least 2 hours or preferably overnight.",
      "After the meat has marinated, prepare your charcoal or gas grill well in advance of grilling to make sure that the grill is hot and ready by the time you have skewered the kebabs.",
      "Remove the filet pieces from the fridge and place them on a cutting board to begin the skewering process. Flat and long skewers are necessary for this style of kebab.",
      "Place one hand on the top of the first filet piece, and gently and carefully push a skewer through the meat until it is firmly secured. Repeat until all the kebabs have been skewered.",
      "Place the skewers over the grill and cook the kebabs for 6-8 minutes depending on the temperature and strength of your gas grill.  Be sure to rotate the skewers frequently for even cooking. You will notice that as the kebabs cook they will get firmer and no longer droop over the skewers.",
      "Serve Kabob Barg with grilled vegetables, flatbread of your choice, or a pot of steamed basmati rice."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2022/05/05/kabob-barg-filet-mignon-kebabs/"
  },
  {
    "id": "caspian_3615bce0",
    "name": "Kabab Tabei",
    "description": "Pan fried kebabs",
    "ingredients": [
      "1 medium onion, grated",
      "1 pound ground beef,  or lamb",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper, ground",
      "1/2 teaspoon turmeric, ground",
      "4 tablespoons olive oil, adjust as needed",
      "4 tablespoons olive oil, more as needed",
      "2 medium Yukon Gold potatoes, peeled and sliced 1/4 inch thick",
      "1/4 teaspoon salt",
      "4 tablespoons olive oil",
      "4 ripe tomatoes, sliced",
      "1/4 teaspoon salt"
    ],
    "steps": [
      "In a large mixing bowl, combine all the ingredients for the kebab with the exception of the olive oil.  Mix fully and form into desired patty shapes. I have chosen an oval shaped patty about 3 inches long and 1/2 inch thick.",
      "In a large frying pan, heat the oil over medium high heat and place the patties in the pan, in a single layer.  Fry the patties for about 5 minutes on each side.  Remove from the heat and set aside.",
      "In a large frying pan, heat the oil and fry the potatoes over medium heat for about 8 minutes on each side or until the potatoes are fully cooked and golden.  Sprinkle with salt, remove from the pan and arrange on top of the kebabs.",
      "In the same frying pan, heat the oil and fry the tomatoes on medium high heat for about 2-3 minutes on each side.  Sprinkle with salt, carefully remove from the pan, and place on top of the kebabs and potatoes.",
      "Once the potatoes and tomatoes have been placed on the kebabs, cover the pan and cook for about 5 minutes over low heat to reheat and bring the dish together.",
      "Serve with Persian steamed basmati rice or Persian flat breads, sumac, raw onions and a platter of fresh herbs."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Kebab",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2020/05/23/kabab-tabei-pan-fried-kebabs/"
  },
  {
    "id": "caspian_882dd6ad",
    "name": "Kabab Torsh",
    "description": "Kebabs marinated in pomegranate, and herbs",
    "ingredients": [
      "1.5 Lbs beef, cut into 1.5 – 2 inch pieces Rib-eye  or tenderloin",
      "1 large onion, quartered",
      "4 cloves garlic",
      "1/4 cup olive oil",
      "2 tablespoons fresh lime juice",
      "1 teaspoon salt",
      "1 teaspoon  ground pepper",
      "1/2 teaspoon ground golpar, Persian hog-weed optional",
      "1 cup walnuts",
      "1/2 cup  pomegranate paste",
      "1/2 cup fresh basil,  packed",
      "1/2 cup fresh mint, packed",
      "1/2 cup fresh parsley, packed"
    ],
    "steps": [
      "Cut the beef into 1.5 to 2 inch pieces and place in a large bowl.",
      "In a food processor, gradually combine the remaining ingredients and process until you have a creamy paste.",
      "Add this marinating mixture to the meat and stir well.",
      "Store in the same bowl covered or in a freezer bag in the fridge overnight or up to 24 hours.",
      "30 minutes before grilling, remove the meat from the fridge and wipe some of the excess marinade off the meat, leaving some on the meat.",
      "Using a metal skewer, push the kebab pieces through the skewer.  Making sure to not overcrowd the skewer so that the meat cooks more uniformly and efficiently.",
      "Place the kebab skewers on a preheated grill and cook on one side for about 4 minutes on medium heat before turning them over and cooking for an additional 3-4 minutes.",
      "Persian Kebabs are traditionally served with steamed saffron basmati rice or flat breads that are typically accompanied by grilled onions and tomatoes."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Kebab",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/05/21/marinated-tangy-kebabs-in-pomegranate-and-herbs/"
  },
  {
    "id": "caspian_3554e7cc",
    "name": "Anar Bij",
    "description": "meatballs in pomegranate and herb sauce",
    "ingredients": [
      "3 cups walnuts, finely ground",
      "3 cups  water",
      "1 1/2 teaspoons salt, divided",
      "1 teaspoon turmeric, ground, divided",
      "1 pound ground beef, or lamb",
      "1 small onion, grated, juices squeezed out",
      "1/2 teaspoon pepper, ground",
      "2 tablespoons oil",
      "1 cup finely chopped parsley, about 2 bunches",
      "1 cup finely chopped cilantro, about 2 bunches",
      "1/2 cup finely chopped mint, about 1 bunch",
      "8 green onions,  finely chopped.  Or 4 tablespoons dried Persian Tarreh",
      "1/4 to 1/2 cup pomegranate molasses, amount will vary from brand to brand"
    ],
    "steps": [
      "Using a food processor, grind the walnuts to a fine powder and set aside.  Using the same food processor, finely chop the herbs one batch at a time and set aside.",
      "Place the ground walnuts, water, 1 teaspoon salt,  and 1/2 teaspoon of turmeric in a large pot and bring to a gentle simmer.",
      "Cover and cook on low heat for 30 minutes, stirring occasionally.  You should notice how the oil will naturally separate from the ground walnuts and collect on the surface.",
      "While the walnuts are simmering, prepare the meatballs.",
      "Place the ground meat, grated onion, 1/2 teaspoon salt and 1/2 teaspoon turmeric in a medium sized bowl and mix well.",
      "Form the mixture into meatballs about the size of a walnut and set aside.",
      "Select a large frying pan, add oil and saute the meatballs on medium heat to lightly brown them and firm them up, about 10 minutes.  Turn off the heat and set them aside.",
      "Once the walnuts have simmered for 30 minutes, add the meatballs, the herbs and the pomegranate molasses.  Cover and simmer over low heat for an additional 30 minutes.",
      "Adjust the seasoning to your taste depending on the tartness or sweetness of your pomegranate molasses.",
      "Serve with Persian steamed rice or flat breads along with a platter of fresh herbs."
    ],
    "minutes": 20,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Main Course",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2021/04/22/anar-bij-meatballs-in-pomegranate-and-herb-sauce/"
  },
  {
    "id": "caspian_d9c79575",
    "name": "Khoresh Aloo Esfenaj",
    "description": "Spinach and golden plum stew with lamb",
    "ingredients": [
      "1 large onion, thinly sliced",
      "4 tablespoons  ghee or olive oil,  divided",
      "1 lb lamb, cut into 1 inch pieces",
      "1/2 teaspoon turmeric, ground",
      "1 1/2 cups water, adjust as needed",
      "1 teaspoon salt, adjust to taste",
      "1/2 teaspoon black pepper, ground",
      "1 cup Aloo Zard, Persian golden plums",
      "4 tablespoons Ab Ghooreh (unripe sour grape juice), or lemon juice, adjust to your taste",
      "4 bunches spinach, roughly chopped"
    ],
    "steps": [
      "In a large frying pan, heat 2 tablespoons of ghee and saute the onions on medium heat for about 10 minutes before adding the lamb and turmeric.  Continue to saute for another 5 minutes.  The lamb and onions should have turned a beautiful golden color and become aromatic.",
      "Add water, salt, pepper, cover, and cook for 60 minutes on low heat or until the meat is fully cooked and tender.",
      "In the meantime, heat the remaining 2 tablespoons of ghee and saute the spinach over medium-high heat for about 10 minutes until the spinach has fully wilted and most of the liquid has evaporated.",
      "Once the meat has been cooked, add the Aloo Zard and Ab Ghooreh and increase the temperature a bit so to remove most (but not all) of the remaining liquid. The stew should not be overly watery.",
      "Add the previously sauteed spinach to the meat mixture, lower the flame, cover and cook for another 10 minutes.",
      "Serve the Khoresh with Persian steamed basmati rice with a side of yogurt."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2020/04/11/khoresh-aloo-esfenaj-spinach-and-golden-plum-stew-with-lamb/"
  },
  {
    "id": "caspian_0aa3326a",
    "name": "Khoresht-e Bademjan",
    "description": "Eggplant and lamb stew﻿ with unripe sour grapes",
    "ingredients": [
      "4 tablespoons olive oil,  divided",
      "2 pounds lamb shanks with bone in",
      "1 large onion, diced",
      "4 cloves garlic, minced",
      "1 teaspoon turmeric, ground",
      "6 fresh ripe tomatoes, diced",
      "2 tablespoons tomato paste",
      "2 1/2 cups water",
      "2 teaspoons salt, divided",
      "1/2 teaspoon pepper, ground",
      "6 tablespoons verjuice (unripe sour grape juice), or fresh lemon juice, adjust to your taste",
      "4 tablespoons Ghooreh, unripe sour grapes",
      "6 tablespoons olive oil,  adjust as needed",
      "3 Chinese eggplants, or 2 small Italian, peeled, and quartered lengthwise"
    ],
    "steps": [
      "In a large Dutch oven, saute the lamb shank with 2 tablespoons of oil for 5 minutes on medium-high heat, turning a few times. Remove from the pan and set aside.",
      "Add the onions to the Dutch oven and saute over medium-low heat for about 10 minutes or until lightly golden.",
      "Add garlic and turmeric and saute for 2 additional minutes.",
      "Add the tomato paste and continue to saute for 2 minutes.",
      "Return the lamb, add tomatoes, water, 1 teaspoon salt, and pepper, cover, and bring to a gentle simmer. Reduce heat and simmer on low heat for 60 minutes.",
      "While the lamb cooks, toss the peeled and quartered eggplants with the remaining 1 teaspoon of salt.",
      "In a large frying pan, saute the eggplants over medium-low heat with oil to lightly brown the eggplants on all sides, about 15 minutes. Remove from the pan and set aside.",
      "After the lamb has been cooking for 60 minutes, add verjuice, and Ghooreh. Stir and continue to cook for 30 minutes.",
      "Arrange the partially cooked eggplants on top of the stew and gently press them down to submerge them into the stew.",
      "Cover and cook over low heat for another 30 minutes. Lamb should be tender at this stage.",
      "Remove from heat, adjust for seasoning and allow to sit for 5 minutes before serving.",
      "Gently transfer the stew into a serving dish without disturbing the eggplants too much so that they maintain their integrity.",
      "Serve the stew with Persian saffron basmati rice."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2018/12/18/eggplant-and-lamb-stew-with-unripe-sour-grapes/"
  },
  {
    "id": "caspian_ac0bdbd5",
    "name": "Khoresht-e Bademjan ba Morgh",
    "description": "Eggplant stew with chicken in tangy tomato sauce",
    "ingredients": [
      "2 tablespoons olive oil",
      "4 chicken pieces,  with bones and skin on",
      "1 large onion, diced",
      "4 cloves garlic, minced",
      "1 teaspoon turmeric,  ground",
      "2 medium tomatoes, diced",
      "4 tablespoons tomato paste",
      "1 1/2 cups  water, adjust as needed",
      "2 teaspoons salt, divided, adjust as needed",
      "1/2 teaspoon  pepper, ground",
      "6 tablespoons verjuice (unripe sour grape juice), or fresh lemon juice, adjust to your taste",
      "4 tablespoons unripe sour grapes (Ghooreh), Fresh or frozen",
      "3 Asian eggplants or 2 medium Italian, peeled and quartered lengthwise",
      "6 tablespoons olive oil"
    ],
    "steps": [
      "In a large Dutch oven, saute the chicken pieces with 2 tablespoons of oil for 5 minutes on high heat, turning the chicken once.  Remove from the pan and set aside.",
      "Add the onions to the Dutch oven and saute over medium heat for about 10 minutes or until lightly golden.",
      "Add garlic and turmeric and saute for 2 additional minutes.",
      "Add the tomato paste and continue to saute for 2 minutes.",
      "Return the chicken, add tomatoes and water, 1 teaspoon salt, pepper, cover, and bring to a gentle simmer.  Reduce heat and simmer on low heat for 30 minutes.",
      "While the chicken cooks, toss the peeled and quartered eggplants with the remaining 1 teaspoon of salt.",
      "In a large frying pan, saute the eggplants over medium-low heat with oil to lightly brown the eggplants on all sides.  About 15 to 20 minutes.  Remove from the pan and set aside.",
      "After the chicken has been cooking for 30 minutes, add verjuice, and Ghooreh.  Stir and continue to cook for 30 minutes.",
      "Arrange the partially cooked eggplants on top of the stew and gently press them down to submerge them into the stew.",
      "Cover and cook over low heat for another 30 minutes.  Chicken should be tender at this stage.",
      "Remove from heat, adjust for seasoning and allow to sit for 5 minutes before serving.",
      "Gently transfer the stew into a serving dish without disturbing the eggplants too much, so that they maintain their integrity.",
      "Serve the stew with Persian saffron basmati rice."
    ],
    "minutes": 15,
    "nutrition": {
      "calories": 350,
      "protein": 25,
      "carbohydrates": 40,
      "fat": 15
    },
    "tags": [
      "Persian",
      "Traditional",
      "Authentic"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 75,
    "source_url": "https://thecaspianchef.com/2019/09/01/eggplant-stew-with-chicken-in-tangy-tomato-sauce/"
  }
]