[
  {
    "id": "pm_a6e56945",
    "name": "AAB TALEBI | CANTALOUPE SMOOTHIE",
    "description": "This Aab Talebi (Cantaloupe Smoothie) is a refreshing and nutritious drink that makes a great breakfast as well as a cooling midday snack. It is a delicious and creamy smoothie that is also very healthy. Cantaloupe is one of the most popular melons that grows in different parts of the world including Africa, Europe, India, Iran, and U.S. It is loved for its juicy sweetness and numerous health benefits. Cantaloupe is believed to have anti inflammatory properties, and it is a powerful antioxidant ",
    "ingredients": [
      "Half of a refrigerated cantaloupe (or honeydew melon)",
      "¼ cup firm whole fat plain yogurt (or Greek yogurt)",
      "1 TBSP honey",
      "½ cup ice cold water",
      "1-2 tsp rosewater",
      "Ground cardamom, to be sprinkled on top"
    ],
    "steps": [
      "Cut a well chilled cantaloupe in half. Use a spoon to scoop out and discard the seeds.",
      "Save one of the halves for a later use. Peel and discard the skin. Cut up the cantaloupe in pieces that would fit inside the chamber of your blender.",
      "Add the cantaloupe, yogurt, honey, rosewater and water to the chamber of your blender. Process until very smooth.",
      "Pour into glasses and sprinkle the top with ground cardamom."
    ],
    "minutes": 60,
    "n_ingredients": 6,
    "n_steps": 4,
    "servings": 2,
    "difficulty": "Easy",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Beverage",
    "meal_type": [
      "Beverage"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 40,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/aab-talebi-cantaloupe-smoothie/",
    "scraped_at": "2025-08-28T20:36:13.534594",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_0549336a",
    "name": "AASH RESHTEH",
    "description": "Aash Reshteh is a hearty Persian noodle soup with fresh herbs and legumes. Reshteh means noodles. The type of noodles used in this particular Aash is called reshteh aash, which are flat flour noodles. Aash Reshteh is very popular in Iran, whether enjoying a hot pot of it for a Friday lunch with the family, or cooking gallons of it in giant pots to share as votive ‘nazri’ with anyone who is hungry. I use homemade beef or chicken stock in this aash, but vegetable stock or water may be substituted ",
    "ingredients": [
      "1 medium yellow onion, peeled and diced small",
      "1 TBSP vegetable oil",
      "9 cups low sodium beef stock (may substitute with chicken stock or vegetable stock)",
      "2 TBSP tomato paste",
      "¼ cup short grain rice (calrose rice)",
      "¼ cup coarse bulgur",
      "¼ cup lentils",
      "8 ounces fresh baby spinach leaves",
      "3 ounces sliced scallions",
      "3 ounces chopped fresh parsley",
      "3 ounces chopped fresh cilantro",
      "2 TBSP dried tarragon leaves, crushed",
      "3 TBSP dried mint leaves, crushed",
      "1 ½ -2 tsp kosher salt",
      "½ tsp fresh ground black pepper",
      "1 cup cooked pinto beans or canned pinto beans",
      "1 cup cooked garbanzo beans or canned garbanzo beans",
      "5 garlic cloves sliced thin",
      "2 large yellow onions (about 1½ pounds), sliced thin, or 10 ounces fried onions",
      "4 Tbsp vegetable oil",
      "2 TBSP butter",
      "1 tsp turmeric",
      "3 cups boiling hot water",
      "4 ounces reshte aash (Raw Noodles) or linguine noodles",
      "GARNISH:",
      "¾ cup reserved fried onions",
      "2 TBSP butter",
      "2 TBSP dried mint leaves",
      "¼ tsp ground saffron powder (optional)",
      "2 cups low fat plain yogurt or sour cream beaten slightly with 1 TBSP cold water until smooth (divided)"
    ],
    "steps": [
      "Heat 1 TBSP vegetable oil in a large stockpot. Saute the diced onion until translucent. Add the beef stock and the rest of the listed ingredients, ending with 1 cup of garbanzo beans, to the pot",
      "Bring it to a boil. Cover and cook over medium low heat for 1 hour. Stir occasionally.",
      "Meanwhile in a large skillet heat the vegetable oil and butter. Add the sliced onions and saute over medium high heat until the edges start turning golden. Reduce the heat to medium and fry until all uniformly golden brown. At the onset of frying it might seem that there is not enough oil but don’t add any extra oil.",
      "To make the garnish, transfer ¾ cup of the fried onions to a small skillet, add 2 tablespoons of butter and 2 tablespoons of dry mint leaves. Stir over low heat until the butter melts. Turn off the heat, sprinkle the optional ground saffron powder and stir to combine. Set aside.",
      "To the remaining fried onions add turmeric and the sliced garlic cloves, stir and sauté over low heat for 3-4 minutes. Do not brown the garlic.",
      "Add 3 cups boiling hot water and the onion/garlic mixture into the stockpot and cook covered for 10 minutes over medium low heat.",
      "Break the noodles into 1-2 inch pieces and add to the pot.",
      "Cover the stockpot and simmer over medium low heat for about 10-15 minutes, or until the noodles are tender.",
      "Remove from the heat. Add the aash to a large serving bowl. Add 1 cup of the thinned yogurt to the aash and stir to combine.",
      "Drizzle the rest of the yogurt on top of the aash. Garnish with the onion and mint mixture.",
      "Serve in bowls with toasted sangak or any bread of your choice."
    ],
    "minutes": 4,
    "n_ingredients": 30,
    "n_steps": 11,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Soup",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -16,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/persian-herb-noodle-soup-aash-reshteh/",
    "scraped_at": "2025-08-28T20:36:15.120450",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_91b99cc5",
    "name": "AASH SHALGHAM",
    "description": "Aash Shalgham is a Persian turnip soup is known and loved as the best cold remedy in Iran’s cold winter months. Shalgham is turnip and Aash is what Persians call a thick and hearty soup. There are many varieties of Aash in the Persian cuisine with complex flavors and usually numerous ingredients that make them wholesome and wonderful, and Persians love their aash. This recipe can be suitable for a vegetarian diet by using vegetable stock instead of the chicken stock and will fit a vegan menu by ",
    "ingredients": [
      "½ cup uncooked Jasmine rice",
      "⅓ cup bulgur",
      "3 cups cold water",
      "1 tsp kosher salt",
      "1 TBSP tomato paste",
      "¼ tsp freshly ground black pepper (optional)",
      "1/16 tsp ground cayenne pepper (optional)",
      "6 cups chicken stock (or vegetable stock for a vegetarian version)",
      "3 cups coarsely chopped beet greens and stems",
      "3 medium turnips, peeled and diced medium (about ¾ inch cubes)",
      "2 medium carrots, peeled and sliced thin",
      "1 cup garlic chives (Persian tareh), or scallion greens",
      "½ cup chopped parsley",
      "½ cup chopped cilantro",
      "1 cup cooked garbanzo beans (home cooked or drained from a can)",
      "½ cup cooked red beans (home cooked or drained from a can)",
      "½ tsp crushed dried mint leaves, to be added at the end"
    ],
    "steps": [
      "Add rice, bulgur, ½ tsp kosher salt and 3 cups of water to a 6-Qt nonstick stockpot. Bring it to a boil, then reduce the heat to medium low. Simmer without covering for about 15 minutes, or until the rice and bulgur are tender but firm and most of the water is cooked off.",
      "Add 6 cups chicken stock and 1 tablespoon tomato paste. Stir until the tomato paste is dissolved. Add the optional peppers (leave them out if you're preparing this aash for someone with a cold and cough), coarsely chopped beet greens and stems, cubed turnips, sliced carrots, herbs and cooked legumes.",
      "Bring all the ingredients to a boil over medium heat, then reduce the heat to the marking between low and medium low. Cover the pot and simmer for about 30 minutes, or until the turnips are tender. Stir several times during this time to prevent sticking.",
      "Add ½ tsp crushed dried mint leaves. Bring Aash Shalgham to a boil over medium heat. Reduce the heat to medium low and cover the pot. Stir occasionally and cook for another 5 minutes.",
      "Serve hot with a spoonful of yogurt or a squeeze of fresh lemon juice. Enjoy Aash Shalgham with Sangak (Persian flat bread) or a crusty Italian or wholegrain bread."
    ],
    "minutes": 30,
    "n_ingredients": 17,
    "n_steps": 5,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Soup",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/aash-shalgham/",
    "scraped_at": "2025-08-28T20:36:16.879071",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_6aee1710",
    "name": "ABDOOGH KHIAR | COLD CUCUMBER AND YOGURT SOUP",
    "description": "I believe this is the right time to share my Abdoogh Khiar (Persian cold cucumber and yogurt soup) recipe with you. If you have visited my “How To” page, you’ve probably seen my post called All About Herbs! As I have mentioned in that post, I grow some herbs in my backyard and love it. This time of year the perennial herbs have come back. One of my perennial herbs is summer savory which is really not readily available in stores and is one of the more finicky herbs to grow here. Our mountainous a",
    "ingredients": [
      "3 small Persian cucumbers with skin (or 1 ½ English cucumbers), diced very small. The cucumbers with tougher skin should be peeled.",
      "16 ounces plain low-fat yogurt",
      "⅓ cup thinly sliced fresh chives (may substitute very thinly sliced scallions, green parts only)",
      "¼ cup chopped fresh dill",
      "¼ cup chopped fresh summer savory (may substitute fresh Greek oregano or thyme)",
      "½ teaspoon kosher salt",
      "⅓ cup raisins, picked through and rinsed under cold water",
      "1 ½ tablespoon crushed dried rose petals, or ½ tsp rosewater (gholab) - Optional",
      "½ cup very cold water",
      "1 cup ice cubes",
      "Chopped fresh dill and crushed rose petals for garnish",
      "1-2 cups of crushed toasted lavash bread or flour tortilla (optional) I have not used in this recipe."
    ],
    "steps": [
      "In a medium bowl combine diced cucumbers, low-fat yogurt, sliced chives, and chopped fresh dill and fresh summer savory. You may substitute very thinly sliced scallions for the chives and chopped fresh Greek oregano or thyme for the summer savory.",
      "Add ½ tsp kosher salt and stir well.",
      "Fold in ⅓ cup raisins.",
      "Fold in 1 ½ TBSP crushed dried rose petals (optional).",
      "Refrigerate uncovered for one hour before serving.",
      "When ready to serve, add ½ cup very cold water, stir to get a uniform soup consistency.",
      "Add 1 cup of ice cubes to the soup and ladle it into bowls, serving couple of ice cubes per bowl.",
      "Garnish with extra chopped fresh dill and crushed dried rose petals.",
      "Place the optional crushed toasted lavash in a bowl and pass it around to be sprinkled on top of the soup."
    ],
    "minutes": 10,
    "n_ingredients": 12,
    "n_steps": 9,
    "servings": 3,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Beverage",
    "meal_type": [
      "Beverage"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/abdoogh-khiar-cold-cucumber-and-yogurt-soup/",
    "scraped_at": "2025-08-28T20:36:18.619306",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_528a79f4",
    "name": "ABGOOSHT",
    "description": "Abgoosht or Abgusht is a one-pot comfort food that is a rustic dish with wholesome ingredients. This stew has been enjoyed by our Persian ancestors over the centuries and still remains as one of the most popular meals in Persian cuisine. Abgoosht means “meat broth” word by word, but it is so much more! It is a delightful combination of the most tender meat and potatoes plus, vegetables, spices, and legumes. Then there is the broth mixed with pieces of sangak or lavash bread; that is the best par",
    "ingredients": [
      "2 ½ - 3 pounds bone-in beef short ribs, about 5 large meaty ones",
      "1 medium yellow onion, peeled and diced",
      "1 tsp ground turmeric",
      "½ tsp ground black pepper",
      "5 large garlic cloves, peeled",
      "2 ½ cups water",
      "1 ¼ tsp kosher salt",
      "1 TBSP plus 1 tsp tomato paste",
      "2 ½ cups home-cooked garbanzo beans, or drained canned beans",
      "5 ounces fresh small okra (optional)",
      "2 Roma tomatoes, halved",
      "1 cup ghooreh (unripe sour grapes) (may substitue with 3-4 Persian dried lime)",
      "12 ounces white potatoes, peeled and cut into 1 ½ inch chunks",
      "½ cup medium-diced green bell pepper (optional)",
      "¼ tsp saffron powder (optional)",
      "Pieces of Sangak or pita bread for “Tileet,”or broth soup"
    ],
    "steps": [
      "Trim all the external fat from the short ribs. Place the ribs in a bowl and cover with cold water. Let it sit until the other prep work is done. Adding cold water helps drain some of the blood that is in the meat and gives it a nice pink color and a better taste. Drain and discard the water before adding the ribs to the pot.",
      "In a medium dutch oven, or a stockpot with a heavy lid that will not allow too much moisture loss, add the short ribs, diced onion, ground turmeric, ground black pepper, garlic cloves, and water. Bring it to a boil, then reduce the heat to medium low and cook covered for 1 ½ -2 hours, or until the ribs are very tender and fall off the bone. Pull the bones off the meat and discard.",
      "Select small green okra when buying; the larger ones will be woody and not as tender. Wash and drain the okra, remove the tip and stem. If the okra is larger than 2 inches long, cut into 2-inch pieces. Set aside.",
      "Add salt and tomato paste to the pot . Use a spoon to stir the tomato paste around in the broth until it dissolves completely.",
      "Add the cooked garbanzo beans, okra, ghooreh (sour grapes), diced green pepper, halved tomatoes, and cut potatoes to the pot.",
      "Sprinkle ¼ tsp optional saffron powder over the ingredients.",
      "Bring the ingredients to a boil then reduce the heat to medium low, cover and cook for about one hour. There should be about 1 ½ cups of broth after everything is nice and tender. This broth will be used to make “Tileet,” or broth soup with flat bread. Add more water as needed but if you add it at the end, bring it to a boil, then reduce the heat to medium low and cook for an extra 10 minutes so the broth does not taste watered down.",
      "Fill ⅓ of a medium bowl with bite size pieces of Sangak (Persian flat bread) or pita bread. Set aside.",
      "To serve the Abgoosht: Use a slotted spoon to transfer the ingredients to a serving platter leaving as much broth in the pot as possible. Pour all the broth over the bread pieces in the bowl and toss to coat and serve immediately.",
      "Serve the rest of the Abgoosht ingredients (either whole or mashed) with additional toasted flat bread, wedges of raw red or white onions, Sabzi Khordan (fresh herbs), Torshi (pickled vegetables)."
    ],
    "minutes": 120,
    "n_ingredients": 16,
    "n_steps": 10,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 100,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/abgoosht-persian-short-ribs-vegetable-stew/",
    "scraped_at": "2025-08-28T20:36:20.387901",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_bdc3931c",
    "name": "ADAS POLO BA KADOO HALVAII",
    "description": "Adas Polo ba Kadoo Halvaii is a beautiful and delicious Persian lentil rice with roasted butternut squash, Medjool dates (khorma) and warm spices Advieh. Adas means lentil, polo is rice. Kadoo Halvaii is butternut squash in Farsi, with Kadoo meaning squash and the root of word halva means “sweet.” There are different recipes for adas polo, and I love all of them because adas is one of my favorite legumes with its firm texture and nutty taste. Lentils have very high levels of slowly digested star",
    "ingredients": [
      "1 medium butternut squash (2 to 2½ pounds)",
      "2 TBSP butter, melted",
      "1 TBSP brown sugar",
      "¼ tsp kosher salt",
      "¼ tsp ground black pepper",
      "1 large yellow onion, peeled and sliced thin",
      "2 TBSP vegetable oil",
      "1 TBSP butter",
      "⅛ tsp turmeric",
      "7 plump Medjool dates, pitted",
      "⅛ tsp ground ginger",
      "2½ cups Basmati rice",
      "⅔ cup lentils, cooked until tender but firm",
      "⅛ tsp salt",
      "1 tsp Persian Rice Spice, divided",
      "(Optional) ⅛ tsp ground saffron powder mixed with ⅛ cup hot water",
      "For the saffron yogurt tahdig:",
      "½ cup low fat yogurt",
      "A dash of saffron",
      "1 cup of the par cooked rice",
      "3 TBSP oil",
      "2 TBSP butter",
      "If serving fried eggs with this rice, fry 1-2 eggs in butter (per person)"
    ],
    "steps": [
      "Preheat the oven to 400 F, center rack. Line a large baking sheet with aluminum foil for easy cleanup.",
      "Pick through ⅔ cup lentils and rinse under cold water. Add the lentils to a small saucepan and fill with enough water to cover them by 1 inch. Add ⅛ tsp salt. Cook the lentils until tender but firm. Drain and set aside.",
      "Take the pits out of 7 large dates and dice them to medium cubes. Set aside.",
      "Peel and seed the butternut squash. Cut the squash in half lengthwise and cut it into ¾ inch thick slices. Cube the slices to ¾-inch bite size pieces. Place the cubed squash in a bowl and add the melted butter, salt, pepper and brown sugar. Toss to coat. Arrange the squash pieces on the prepared baking sheet. Bake in the preheated 400 F oven for about 25 minutes, or until tender. Set aside.",
      "Meanwhile heat the vegetable oil and butter in a large nonstick skillet. Add the sliced onions and saute over medium heat. When the onion starts turning golden brown on the edges add the turmeric and continue frying until they are rich golden brown. Reduce heat to medium low and add the diced dates and ⅛ teaspoon ground ginger to the fried onions and saute for 2 minutes. Remove from the heat and toss with the roasted butternut squash. Set aside.",
      "Please follow the instructions for cooking the Persian rice up to the point where the rice is par cooked and drained in a colander and rinsed under cold water and drained. Remove 1 cup of the rice and reserve it for the TahDig. Toss the remaining par cooked rice with the cooked lentils. Set aside.",
      "To make the TahDig mixture: In a small bowl whisk the yogurt and saffron only until blended. Stir in the 1 cup of par cooked rice until well coated.",
      "Heat 3 tablespoon vegetable oil and 2 tablespoon butter in the same stockpot over medium low heat until hot (not smoking)",
      "Add the saffron yogurt and rice mixture to the hot oil and use the back of your spoon to cover the bottom of the pot evenly.",
      "Add ⅓ of the lentil rice on top of the yogurt and rice mixture; sprinkle with ⅓ of the Persian Rice Spice, add half the butternut squash and date mixture. Repeat this one more time, then add the remaining lentil rice and rice spice on top.",
      "(optional) Add ⅛ tsp ground saffron powder to ⅛ cup of hot water, stir to dissolve. Pour the liquid saffron on top of the layered rice. Cover the lid with a damkesh or kitchen towel. Steam the rice over medium low heat for 1 hour.",
      "Serve the Adas Polo ba Kadoo Halvaii by itself, or with eggs fried in butter (Nimroo), or with chicken."
    ],
    "minutes": 30,
    "n_ingredients": 23,
    "n_steps": 12,
    "servings": 5,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Dessert",
    "meal_type": [
      "Dessert"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/adas-polo-ba-kadoo-halvaii/",
    "scraped_at": "2025-08-28T20:36:22.175435",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_a24f1f4d",
    "name": "APPLE CINNAMON OATMEAL",
    "description": "The weather is steadily getting colder around here. I don’t know about you but a cold breakfast does not appeal to me on these chilly mornings. This Apple Cinnamon Oatmeal is a delicious and satisfying breakfast that warms me up inside and kick starts my morning to give me enough energy to keep going until lunchtime without getting hungry. I have used steel-cut oats in my Apple Cinnamon Oatmeal. My daughter introduced me to these oats and I love them. This kind of oats are oat grouts with outer ",
    "ingredients": [
      "½ cup steel cut oats",
      "3 cups milk (I used 1%)",
      "2 pinches salt",
      "½ tsp ground cinnamon",
      "1 cup diced unpeeled sweet apples (Gala, Jonathan, or golden delicious)",
      "Garnish:",
      "Extra apple slices on the side",
      "Butter",
      "Extra ground cinnamon",
      "Honey (optional)"
    ],
    "steps": [
      "Add milk, oats, salt and cinnamon to a 3-Qt nonstick pot. Bring it to a boil over medium heat without covering the pot and stir a few times to prevent oats from sticking to the bottom.",
      "Reduce heat to between medium low and low and without covering simmer for 30 minutes. Stir occasionally. Keep a close eye on it because oats tend to overflow. At this point the oats will be soft and the liquid will be reduced to about half and thickened.",
      "Wash and dice a medium or large sweet apple without peeling it for added nutrition, fiber and flavor. If the skin is tough, peel it and then dice. Add the diced apple and stir. Increase the heat to medium low and bring it to a low boil. Continue cooking for another 5 minutes, stirring frequently to prevent sticking.",
      "Ladle the oatmeal into two bowls and top each with extra ground cinnamon and a dab of butter. Serve with extra apple slices and honey on the side."
    ],
    "minutes": 30,
    "n_ingredients": 10,
    "n_steps": 4,
    "servings": 2,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/apple-cinnamon-oatmeal/",
    "scraped_at": "2025-08-28T20:36:23.902100",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_ac879466",
    "name": "APPLE PIE",
    "description": "With Thanksgiving only a few days away I have decided to post this special Apple Pie recipe with a homemade crust that I have been baking since college. The double crust is super flaky and is filled with thin slices of fresh apples that are baked with warm cinnamon and nutmeg spices. Apple has always been my favorite pie and this one is a particularly light and delicious holiday dessert that is also perfect any day with afternoon tea or morning coffee. Since this Apple Pie was probably one of th",
    "ingredients": [
      "INGREDIENTS FOR THE CRUST",
      "2⅔ cups all-purpose flour",
      "½ tsp salt",
      "¾ cup vegetable oil",
      "5 TBSP cold water",
      "INGREDIENTS FOR THE FILLING",
      "1 cup granulated sugar",
      "⅓ cup all-purpose flour",
      "1 tsp cinnamon",
      "½ tsp nutmeg",
      "⅛ tsp salt",
      "2 ½ pounds (8 cups) thinly sliced firm apples (about 6-7 medium apples)",
      "1 TBSP fresh squeezed lemon juice",
      "3 TBSP (1 ½ ounces) cold butter, cubed into small pieces"
    ],
    "steps": [
      "Make the filling: Core and peel apples. Slice the apples into ¼ -inch slices. Place in a large bowl.",
      "In a small bowl whisk together sugar, flour, spices and salt. Sprinkle the sugar mixture over the sliced apples and toss to coat. Set aside.",
      "Make the crust: Add 2⅔ cup flour and ½ tsp salt into a medium bowl and whisk to combine. Add the oil to flour and mix with a fork for 5-7 minutes, or until the mixture is uniformly moist and there is no dry flour seen.",
      "Sprinkle cold water 1 tablespoon at a time and mix with the fork after each addition. Continue this until the mixture is moistened uniformly and pulls away from the sides of the bowl. If the dough seems dry, add additional one tablespoon of oil. Do not add extra water.",
      "Gather dough with your hands and press firmly into a ball. Divide the dough in half and make two balls. Flatten each ball into a disk.",
      "Place one disk between two large silicone baking mats, or two squares of parchment paper (If using parchment paper, wipe the surface with a damp paper towel to help stick the paper to the work area so it does not slip).",
      "Use a rolling pin and roll the disk of dough into a 10-11 inch circle. Smooth the edges with your fingertips.",
      "Remove the top silicone mat (or paper) and lift the dough with the bottom mat and line the pie pan and peel away the mat.",
      "Add the apple mixture to the pie pan. The pan will be very full. Dot the top with cubed butter.",
      "Roll the top crust just as for the bottom crust and lay it over the apple mixture with the help of the silicone mat (or paper) and peel away the mat. Bring the edges of bottom and top crust together and seal completely by pressing around the edge with the tip of a fork. Use a sharp knife to make slits on the top crust.",
      "Cover the edges with a few strips of 3-inch wide aluminum foil to prevent over browning during the baking. Place the pie pan in a shallow baking sheet to catch any possible drippings.",
      "Bake for 50-55 minutes, or until the juices begin to bubble through the slits and the crust is golden brown. Remove the aluminum foil strips during the last 15 minutes of baking.",
      "Remove the pie from the oven. Place on a rack and cool for at least 30 minutes before cutting into wedges."
    ],
    "minutes": 15,
    "n_ingredients": 14,
    "n_steps": 13,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -5,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/apple-pie/",
    "scraped_at": "2025-08-28T20:36:25.494596",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_8e56713e",
    "name": "BAGHALI GHATOGH | FAVA BEANS WITH DILL",
    "description": "Today I’m sharing a vegetarian dish called Baghali Ghatogh which is a specialty from one of my favorite places in the world, Gilan Province in North of Iran. The northern part of Iran is called ‘Shomal’ (North) by many Iranians. Gilan is near the beautiful lush green Jangal (forest) Mazandaran, the calm and warm Caspian Sea (Daryay Khazar), with endless green rice fields. Once you visit this area the memory of this magical picturesque place will forever stay with you. As a child I visited Shomal",
    "ingredients": [
      "Two 14-ounce packages of frozen fava beans, or about 2 pounds of podded and peeled fresh fava beans. Frozen lima beans may be substituted for fava beans.",
      "½ cup butter",
      "1 tsp kosher salt",
      "⅛ tsp freshly cracked black pepper",
      "2 cloves garlic, roughly chopped",
      "¾ tsp turmeric powder",
      "1 cup chopped fresh dill or ¼ cup dried dill",
      "1 large onion sliced and fried to golden brown (about 4 ounces fried onions)",
      "3 TBSP vegetable oil for frying the onion",
      "2 ½ cups hot water",
      "4 eggs, to be cracked whole directly on the cooked fava beans and dill"
    ],
    "steps": [
      "Wash the dill by immersing the tops and tender stems in cold water for a few minutes to loosen any possible grit, repeat a few times until the water is clear. Place the dill in a colander and drain all the water before chopping.",
      "Rinse the frozen fava beans in a colander under warm water to thaw and drain completely.",
      "Thinly slice the onion and fry to golden brown. Set aside.",
      "Heat butter in the cast iron or other oven proof skillet and add the fava beans, salt and pepper. Saute over medium high heat for about 7 minutes, or until the beans are lightly golden and most of the natural juice is cooked off. Stir gently and frequently. Be careful not to break up the beans, the dish looks prettier when the beans are left whole.",
      "Reduce the heat to medium, add the fried onions, turmeric, and chopped garlic. Stir and saute for another 2 minutes.",
      "Add chopped dill and hot water, bring it to a boil then reduce heat to the mark between medium low and low. Cover and simmer for 30 minutes. Most cast iron skillets have pour spouts that do not allow a complete coverage. Add more water if needed to maintain about an inch of liquid in the skillet.",
      "Meanwhile preheat the oven on broil for about 10 minutes, with the rack set on the very top shelf close to the heat element.",
      "Uncover the skillet and crack the 4 eggs one at a time on top in four corners. Leave some space between the eggs so they do not cook into each other. I find that it is easier to crack the eggs into 4 small bowls and keep them ready and add to the skillet when needed. This also eliminates the chance of accidentally dropping eggshells in the food.",
      "Place the skillet in the preheated oven and broil for up to about 2 minutes, or until the egg white is set.",
      "Serve warm with toasted bread or Kateh (Persian Quick Rice) and a side of salad. Serve one whole egg on top of each serving."
    ],
    "minutes": 30,
    "n_ingredients": 11,
    "n_steps": 10,
    "servings": 4,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/baghali-ghatogh-fava-beans-with-dill-eggs/",
    "scraped_at": "2025-08-28T20:36:27.089327",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_bfb68234",
    "name": "BAGHALI POLO BA MORGH",
    "description": "Baghali is Farsi for Fava Beans and in Azeri it is Pakhla. When you mix the amazing Persian steamed rice with baghali and shevid (dill), it is called Baghali Polo. If you have ever tasted green fava beans you know how delicate and buttery they are. The taste is like no other bean and when it is paried with the subtle and pleasant flavors of dill and Basmati rice, this ever popular delicious rice is created. Baghali Polo is fluffy and full of flavor and it complements a variety of meats such as c",
    "ingredients": [
      "3 pounds skinless chicken drumsticks or thighs (about 6 large)",
      "1 ¼ tsp kosher salt",
      "1 ¼ tsp ground turmeric",
      "½ tsp ground black pepper",
      "1 medium yellow onion, cut in half",
      "2 ½ cups cold water",
      "1 large yellow onion, sliced thin and fried to golden brown (4 ounces fried onions)",
      "3 TBSP vegetable oil for frying the onion",
      "2 TBSP tomato paste",
      "1 TBSP fresh lemon juice",
      "⅛ tsp optional saffron powder",
      "Extra water, as needed",
      "FOR THE RICE- (PLEASE FOLLOW THE COMPLETE INSTRUCTIONS FOR PERSIAN STEAMED RICE)",
      "2 ½ cups Basmati rice",
      "Salted water for boiling the rice",
      "14-16 ounces frozen or fresh green fava beans",
      "1 cup chopped fresh dill or ⅓ cup dried dill",
      "4 TBSP vegetable oil",
      "1 TBSP butter",
      "Lavash pieces for Tahdig",
      "Dash of saffron, sprinkled on top of the rice before steaming (optional)"
    ],
    "steps": [
      "Add the chicken pieces, water, onion halves, turmeric, salt and pepper to a 12-inch nonstick skillet (the chicken pieces will be in a single layer). Bring the water to a boil over medium heat, skim off any foam from the top. Reduce heat to medium low, cover the skillet and cook for 45 minutes to 1 hour, or until the chicken is no longer pink inside and fork tender. Discard the onion halves",
      "Meanwhile in another skillet fry the sliced onions in 3 TBSP of vegetable oil until golden brown. Add tomato paste and saute for another 3-5 minutes over medium low heat until aromatic. Set aside.",
      "Sprinkle the top of cooked chicken pieces with the optional ⅛ tsp saffron and use the back of a spoon to smear it on the surface. This will give chicken a rich saffron color as it cooks without using too much saffron; mix a few drops of the broth with saffron if needed.",
      "There should be about 1½ inches of broth in the skillet at this point. Add extra water if needed.",
      "Add the fried onion mixture to the skillet and stir to mix it with the broth. Add fresh lemon juice and bring it to a boil.",
      "Cover the skillet, reduce the heat to low and simmer for 30 minutes. Turn the chicken pieces and continue to simmer covered for another 30 minutes until very tender. Serve over Baghali Polo.",
      "To make the Baghali Polo (Fava Bean and Dill Rice):",
      "Please follow the instructions for cooking the Persian Steamed Rice.",
      "After about 7 minutes of boiling in salt water, when the rice is firm in the center and tender on the two ends, add the fava beans to the pot. Bring the water to another boil and then immediately drain in a colander and rinse with cold water.",
      "Heat the oil and butter in the nonstick pot, cover the bottom of the pot with lavash or tortilla pieces.",
      "Add ⅓ of the cooked rice and fava bean mixture over the lavash. Sprinkle with ⅓ of the fresh or dried dill. Repeat 2 more times until you have used up all the rice mixture and dill. Sprinkle the top with the optional saffron. Cover with a kitchen towel or Damkesh and steam over medium low heat for 45 minutes to one hour, or until steam rises, the rice grains are tender, and the Tahdig is crispy and golden."
    ],
    "minutes": 45,
    "n_ingredients": 21,
    "n_steps": 11,
    "servings": 6,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Rice Dish",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 25,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/baghali-polo-ba-morgh-chicken-fava-bean-rice/",
    "scraped_at": "2025-08-28T20:36:28.919817",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_250204b4",
    "name": "BAKLAVA CAKE | BAGHLAVA CAKE",
    "description": "The recipe that I’m sharing today is the Baklava Cake (or Cake e Baghlava in Farsi). All the wonderful fragrant spices of Baklava (Baghlava) come together in this delightfully light cake that is super moist with a walnut filling and a delicate blend of cardamom, cinnamon and rose essence. Baklava Cake is traditionally made on Persian holidays as well as casual dinner parties. Mix the spices and sugar with coarsely chopped walnuts in a small bowl. Whisk together the butter, eggs, sugar, vanilla, ",
    "ingredients": [
      "FOR THE DOUGH",
      "8 ounces unsalted butter, melted",
      "1 cup sugar",
      "1 cup plain yogurt",
      "2 eggs",
      "1 tsp baking soda",
      "½ tsp vanilla powder or 1 ½ tsp vanilla extract",
      "4 ½ - 5 cups all-purpose flour",
      "FOR THE WALNUT FILLING",
      "2 tsp cardamom powder",
      "2 tsp cinnamon powder",
      "¾ cup powdered sugar",
      "1 ½ cups coarsely chopped walnuts, split-pea sized",
      "2 egg whites, beaten until foamy (save the yolks)",
      "2 egg yolks mixed with 1 tsp cold water for the egg wash",
      "FOR THE SYRUP",
      "1 ½ cups water",
      "1 ½ cups sugar",
      "1 ½ TBSP honey",
      "1 TBSP plus 1 tsp rose water",
      "GARNISH",
      "Chopped pistachios"
    ],
    "steps": [
      "Preheat oven to 350 F, center rack",
      "Grease a 9 x13 x1 inch nonstick baking pan with butter flavored Crisco and lightly dust with flour. Tap the pan over the sink to shake off the excess flour.",
      "To make the walnut fulling, in a small bowl mix 2 tsp cardamom, 2 tsp cinnamon, ¾ cup powdered sugar and 1 ½ cups coarsely chopped walnuts. Set aside.",
      "In a large bowl, whisk all the dough ingredients except the flour, until smooth.",
      "Add the flour gradually and mix well with a wooden spoon after each addition. Add enough flour until the dough stops sticking to the fingers; you may have some leftover flour. On a lightly floured surface pat the dough into a fat rectangle, then divide it into two equal pieces.",
      "Use a rolling pin to roll out one of the dough pieces into a 9 x 13 inch rectangle.",
      "Gently lift the rolled dough and lay it on the prepared baking pan, use your finger tips to gently stretch the dough to fit the bottom of the pan perfectly.",
      "Brush some of the foamy egg white on the dough.",
      "Sprinkle all of the walnut filling mixture over the dough in the pan.",
      "Drizzle the rest of the beaten egg white on the mixture.",
      "On the floured surface roll out the other piece of dough into another 9 x 13 inch rectangle for the top. Carefully cover the nut and spice mixture with the rolled out dough and stretch it with your fingertips to completely cover the top of the pastry. Press the dough onto the filling.",
      "Use a sharp plastic knife to mark the dough into 20 equal rectangles. Cut through the thickness of the pastry on the marks you have made. Brush the egg wash over the entire surface of the pastry.",
      "Bake in preheated 350 F oven for 35-40 minutes, or until the top of the pastry is a rich golden brown.",
      "After 15 minutes into baking start making the syrup: In a 2-Qt saucepan add 1 ½ cups water, 1 ½ cups sugar, and 1 ½ TBSP honey. Bring it to a boil over medium heat. Let it boil for 2-3 minutes. Remove from the heat and add 1 TBSP plus 1 tsp rose water. Set aside until ready to use.",
      "By the time the pastry is ready, the syrup should reach a lukewarm temperature.",
      "Remove the pastry from the oven. Place the pan in a larger baking pan to catch any possible syrup dripping.",
      "Use your plastic knife once again to cut through the baked pastry between the squares. Drizzle all of the lukewarm syrup evenly all over the hot pastry, don’t forget the borders. It might look like all the syrup will not fit in the pan, but it does and all of it will get soaked up to make this cake amazingly moist and delicious. Sprinkle the pastry with chopped pistachio. Allow to cool completely in the pan over a cooling rack before transferring the pastries to a serving platter in a single layer.",
      "This pastry is best when served at room temperature"
    ],
    "minutes": 15,
    "n_ingredients": 22,
    "n_steps": 18,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -5,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/baklava-cake/",
    "scraped_at": "2025-08-28T20:36:30.556209",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_bf267e69",
    "name": "BAKLAVA | BAGHLAVA",
    "description": "Baklava (Baghlava), this popular dessert is made in different parts of the world with some slight variations. It has layers and layers of flaky pastry surrounding nuts and spices and sweetened with an fragrant syrup. I make mine with almond and walnut filling. Baklava, or Baghlava as we call it in Farsi, looks a lot more complicated than it really is. I have another dessert called Baklava Cake that has a walnut filling with spices and is baked between two layers of a homemade dough. This Baklava",
    "ingredients": [
      "20 Phyllo pastry sheets (defrost in the refrigerator for one day, then leave out at room temperature for 30 minutes.",
      "¾ pound sweet butter, melted",
      "FOR FILLING",
      "12 ounces blanched almonds (no brown skin), ground in a food processor (3 cups ground almonds).",
      "6 ounces walnuts, ground in a food processor (1 ½ cups ground walnuts)",
      "3 TBSP granulated sugar",
      "5 tsp ground cardamom",
      "1 tsp ground cinnamon",
      "FOR SYRUP",
      "¾ cup granulated sugar",
      "¾ cup water",
      "¾ cup honey",
      "1 tsp fresh lemon juice",
      "1 TBSP plus ¼ tsp rose water",
      "¼ cup pistachio nuts finely chopped, to sprinkle on top of the pastry"
    ],
    "steps": [
      "Preheat the oven to 350 F, center rack.",
      "To blanch the almonds at home: Place 12 ounces of almonds in a medium bowl. Add enough boiling hot water over them to cover the almonds. Put a plate over the bowl and let it rest for 10 minutes, or until the skins slide off easily. When just cool enough to handle, press the almond between two fingers and the skin will slide right off. Process in the food processor just until fine,",
      "Set the almonds aside and process the walnuts in the food processor, same size as the almonds.",
      "In a small bowl mix sugar, cardamom and cinnamon. Set aside.",
      "Trim the phyllo sheets a bit so they fit the baking dish and you don't have to double fold it on the sides.",
      "Cover the sheets with a large damp pastry cloth to prevent drying.",
      "Brush the bottom and sides of the 9 x 13 x 2 Pyrex pan with the melted butter.",
      "Layer the pan with one phyllo sheet. Brush the entire surface with melted butter. Repeat this with 5 more sheets and brush each with melted butter.",
      "Add half of the ground almonds (1 ½ cups) to the stacked phyllo sheets and use a fork to spread it evenly. Reserve the other half of the ground almonds. Set aside.",
      "Sprinkle 5 teaspoons of the sugar/spice mix evenly over the ground almonds.",
      "Top the ground almonds with one sheet of phyllo pastry and brush it with melted butter. Top with 3 more phyllo sheets, brushing each with melted butter.",
      "Next add the ground walnuts evenly on the phyllo sheet.",
      "If the butter starts to solidify, microwave for 20 seconds.",
      "Sprinkle 5 teaspoons of the sugar/spice mix evenly over the ground walnuts.",
      "Top the ground walnuts with 4 sheets of phyllo, brushing each with melted butter.",
      "Add the reserved ground almonds evenly on the top phyllo sheet.",
      "Sprinkle the remaining sugar/spice mix evenly on top of the ground almonds.",
      "Top the almond layer with the remaining 6 sheets of phyllo pastry, brushing each sheet with the melted butter as above.",
      "Brush the top sheet with butter. Use a sharp knife to score the top sheet into 24 squares, about 2 x 2 inch each. gently cut the pastry into 24 pieces. Make sure to cut through all the layers.",
      "Bake the pastry in preheated 350 F oven for 35-40 min or until golden brown. Remove the baking dish from the oven.",
      "Let the Baklava cool on a wire rack for about 1 hour until lukewarm. Run a knife around the edges of the pan and between the squares before pouring the syrup over the cooled pastry.",
      "MAKE THE SYRUP",
      "Add all the syrup ingredients, except the rose water, to a 1-Qt saucepan.",
      "Bring the mixture to a boil over medium heat.",
      "Reduce heat to medium low and simmer for about 5 min, until the mixtures thickens slightly. Watch the syrup closely, it tends to boil over. Remove from heat and stir in the rose water.",
      "Pour the hot syrup over the lukewarm Baklava.",
      "Sprinkle the top with finely chopped pistachio nuts and wait 2-3 hours to allow the syrup soak through the pastry before serving. Cover and store the extra pastry in the original baking dish for up to 2 days at room temperature.",
      "Baklava freezes well. Once completely cooled, cover the top, without touching the pastries, with parchment paper and heavy duty aluminum foil before storing it in the freezer. To serve, bring to room temperature for about an hour."
    ],
    "minutes": 35,
    "n_ingredients": 15,
    "n_steps": 28,
    "servings": 24,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 15,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/baklava-baghlava/",
    "scraped_at": "2025-08-28T20:36:33.301550",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_a5359e9c",
    "name": "NOON BARBARI",
    "description": "Barbari, Noon Barbari, or Nan Barbari, is a popular traditional Persian flat bread with a crisp crust and light airy texture. Noon, or nan, means bread in Farsi. This bread is best when eaten hot right out of the oven and it is the most favored bread for breakfast (sobhaneh). Some of the special delicacies enjoyed with Noon Barbari are feta cheese (panir) (pictured below) and walnuts (gerdu), clotted cream (sar shir) topped with honey (asal), also butter (kareh) and jam (moraba), or grapes (angu",
    "ingredients": [
      "For The Dough",
      "2 ¼ tsp active dry yeast",
      "¾ tsp granulated sugar",
      "2 cups water (divided)",
      "4 ¼ cups Bread flour for the dough plus ⅓ cup flour for the work surface",
      "2 tsp kosher salt",
      "For The Glaze (roomal)",
      "1 tsp flour",
      "¼ cup cold water",
      "¼ tsp baking soda",
      "¼ cup boiling hot water",
      "Garnish",
      "2-3 tsp white or black sesame seeds (I used a combination) for sprinkling over the Barbari"
    ],
    "steps": [
      "Measure out 4 ¼ cups of flour into a bowl. Add 2 tsp kosher salt and stir briefly with a spoon to combine. Set aside.",
      "Remove the mixing bowl from the stand mixer. Add 2 ¼ teaspoon yeast and ¾ teaspoon sugar to the bowl.",
      "In a microwave safe bowl heat 1 cup water for 25 seconds until lukewarm and add it to the mixing bowl. Use a spoon to gently stir the ingredients in the bowl 3-4 times. Cover the bowl tightly with a plastic wrap first, then cover it with a large kitchen towel and let it rest for 10 minutes.",
      "At this time place the pizza stone on the middle rack of your oven and preheat to 500 F.",
      "The yeast mixture will look puffed up on top and will be very frothy; if it does not get frothy, the yeast has expired and it is time to get fresh yeast before proceeding with the rest of the recipe.",
      "Microwave another 1 cup of water for 25 seconds.",
      "Add half of the flour to the yeast mixture and use a sturdy spoon to mix it. Add the cup of lukewarm water and the rest of the flour. Keep mixing with the spoon until combined.",
      "Attach the mixing bowl to the stand mixer and set it up with the dough hook. With the mixer on medium low (it is #4 on my KitchnAid), beat the dough for 3 minutes until well combined and no dry flour is seen. The dough will be very sticky and that is normal, do not add any more flour. No extra kneading is necessary.",
      "Add all of the dough to a large clean bowl. Cover the bowl tightly with a plastic wrap, then cover the whole thing with the large kitchen towel and let the dough rest for 25 minutes. The dough will rise to about twice the original volume.",
      "Meanwhile prepare the glaze: In a small nonstick skillet add ¼ cup cold water and 1 tsp flour. Use a spoon to completely break up the flour in the water. When you stop stirring the mixture separates and is not uniform. Add ¼ teaspoon baking soda and the ¼ cup hot water to the skillet and stir to combine. Place the skillet on medium low heat and keep stirring until the liquid gets very hot, and comes to a very slow boil. Continue stirring until the liquid is uniformly cloudy and slightly thickened. When you stop stirring the glaze should not separate. Remove the skillet from heat and set it aside on the counter; the glaze will thicken further as it cools.",
      "Sprinkle the work space with ⅓ cup flour. This is a very sticky dough and you will be using this flour to dust your hands and the top of the dough, it will Not get kneaded into the risen dough.",
      "Visually divide the dough inside the bowl into 3, then with floured hands separates one section (will be extremely sticky) and drop it onto the heavily floured surface and flour your hands more if needed. Gently roll the dough on the flour to make a ball that is covered with flour on all sides. Do not knead and don't handle the dough any more than you have to.",
      "Leave the floured ball of dough on the work space and repeat with the remaining dough and again visually take half of the remaining out and cover it in flour. Without covering, let the balls of dough sit for another 10 minutes on the work surface. The dough will rise further.",
      "On a floured part of the work surface without handling the dough too much, use your fingers to flatten one of the balls of dough into an oval shape, about 6 x 9 inches.",
      "Use your fingertips or the back of a spoon to evenly spread about 1 tablespoon of the glaze over the flattened dough.",
      "With fingers touching make several rows of deep indentations with your fingertips along the length of the dough. Then move your fingertip over the markings and make long deep grooves in the dough without tearing into it.",
      "Sprinkle ⅓ of the sesame seeds evenly over the dough and let it sit for 5 more minutes.",
      "Drape a 10 x 15 inch parchment paper over a cutting board or the back of a baking sheet. The dough is going to be very soft and might stick to the work surface, release both ends with a pastry cutter or a thin spatula. Use both hands and carefully lift it and while stretching it to a longer and thinner rectangle (about 6 x 14) transfer it to the parchment paper on the cutting board.",
      "Slide the dough and parchment paper onto the hot stone. Bake for 5 minutes, turn the parchment paper a half circle and bake for another 5 minutes, until it is golden brown.",
      "Use oven mittens to remove the Barbari from the oven and cool on a rack.",
      "While the first Barbari is baking, repeat the same process for shaping the second and later the third ball of dough as explained for the first loaf.",
      "When the bread is cool enough to handle, brush off the extra flour from the back of the Barbaries and cut them into pieces.",
      "This bread is at its best flavor and texture right out of the oven. Enjoy it with feta cheese, grapes, sliced cucumbers, walnuts, olives, or sabzi khordan. Don’t forget to brew some fresh Persian tea half hour before the bread is ready!!",
      "Let the extra pieces cool completely before storing them in a plastic bag."
    ],
    "minutes": 10,
    "n_ingredients": 13,
    "n_steps": 24,
    "servings": 3,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Bread",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/noon-barbari/",
    "scraped_at": "2025-08-28T20:36:34.974741",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_41aebaba",
    "name": "BLACK and RED BEAN CHILI",
    "description": "",
    "ingredients": [
      "1 pound lean ground beef (please see notes for the vegetarian chili)",
      "2 medium yellow onions, chopped in food processor",
      "2 TBSP olive oil",
      "2 tsp kosher salt, divided",
      "¼ tsp freshly cracked black pepper",
      "3 TBSP tomato paste",
      "2 tsp smoked paprika",
      "2 tsp dried oregano leaves, crushed",
      "1 tsp dried basil leaves, crushed",
      "2 tsp ground cumin",
      "1 tsp ancho chile pepper powder",
      "¼ tsp chipotle chile pepper powder",
      "1 cup low-sodium beef broth (or vegetable stock)",
      "2 cups cooked black beans (or one 15-ounce can of black beans drained and rinsed)",
      "2 cups cooked red beans (or one 15-ounce can of red beans drained and rinsed)",
      "2 pounds ripe tomatoes, chopped in food processor (or two 15-ounce cans of diced tomatoes)",
      "6 garlic cloves, minced in food processor",
      "½ large red bell pepper, diced",
      "½ large yellow bell pepper, diced",
      "TOPPINGS",
      "Shredded Colby or cheddar cheese",
      "Chopped fresh cilantro",
      "Sour cream",
      "Sliced scallions"
    ],
    "steps": [
      "Peel and cut the onions in 8 pieces. Add to the food processor and press on/off switch 2-3 times until chopped small. Divide in half.",
      "Add half of the chopped onions, 2 TBSP olive oil, ground beef, 1 tsp of the kosher salt, and freshly cracked black pepper to a 6-Qt stockpot.",
      "Saute over medium heat until onions are tender and the ground beef is no longer pink.",
      "Add the tomato paste, 1 tsp kosher salt, dried herbs, and spices. Stir to combine and saute for 5 minutes.",
      "To mince the garlic try this quick tip: Peel the cloves and with the food processor running drop one at a time through the feed chute until all the cloves are minced.",
      "Cut the tomatoes in big chunks and process by pressing the on/off switch 3-4 times.",
      "Add the chopped tomatoes, minced garlic, the remaining chopped onions, and the rest of the ingredients to the stockpot. Bring it to a boil. Reduce the heat to medium low, cover the pot and simmer for 1 ½ hours. Adjust salt to taste. Add more water as needed.",
      "For a thicker chili cook without a cover in the last 30 minutes of cooking.",
      "Serve with all, or your choice, of toppings: Shredded Colby or cheddar cheese, chopped fresh cilantro, sour cream, and sliced scallions."
    ],
    "minutes": 120,
    "n_ingredients": 24,
    "n_steps": 9,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 100,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/black-red-bean-chili/",
    "scraped_at": "2025-08-28T20:36:36.763855",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_148a3745",
    "name": "BLACK BEAN & CORN SALSA",
    "description": "Today I’m sharing my recipe for Black Bean and Corn Salsa that can be prepared in only minutes and though chilling makes all the flavors infuse better, it is not an absolute necessity if you’re in a hurry, it is still going to taste amazing. I love how colorful and festive Mexican food is and absolutely enjoy all the herbs and spices that add flavor and heat to the dish. When I make Mexican food my two favorite side dishes are: My Zesty Guacamole, and Black Bean and Corn Salsa. Salsa can be a go",
    "ingredients": [
      "One 15-ounce can of black beans (drained and rinsed under cold water), or use the same amount home cooked black beans",
      "One 15-ounce can of whole kernel corn (drained and rinsed under cold water), or steam couple of fresh corns and strip the kernels carefully with a knife",
      "1 cup sliced white and light green parts of the scallions",
      "⅔ cup small diced red onion",
      "1-2 serrano peppers. The more peppers you add the hotter the salsa",
      "½ tsp kosher salt",
      "¼ tsp freshly cracked black pepper",
      "¼ cup fresh squeezed lime juice",
      "⅛ cup extra virgin olive oil",
      "3 firm ripe Roma tomatoes, diced",
      "⅓ cup chopped fresh cilantro"
    ],
    "steps": [
      "Pick through the scallions. Thinly slice the white and light green parts and add to a small bowl and fill with cold water and repeat a few times until there is trace of fine sand . Add the to a colander and drain all the water. Set aside.",
      "Pic through the cilantro and wash carefully; drain in a colander and roughly chop and set aside.",
      "Depending on how spicy you want the salsa wash and deseed 1 or 2 serrano peppers. Roughly chop and set aside.",
      "In a medium bowl add black beans and corn, the sliced scallions, diced red onion, serrano peppers, salt, pepper, fresh lime juice, and extra virgin olive oil. Toss the ingredients together to combine.",
      "Add the diced tomatoes and chopped cilantro to the rest of the ingredients, toss briefly.",
      "Serve right away or chill up to 3-4 hours before serving.",
      "Serve on a bed of shredded lettuce with enchiladas and burritos, or sprinkle over the tacos and nachos."
    ],
    "minutes": 240,
    "n_ingredients": 11,
    "n_steps": 7,
    "servings": 4,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 220,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/black-bean-corn-salsa/",
    "scraped_at": "2025-08-28T20:36:38.522248",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_e316b3c0",
    "name": "SABZI POLO BA MAHI",
    "description": "If you are like me, a seafood fan, you will love this quick and delicious Blackened Salmon with Sticky Herb Rice. I could eat seafood several times a week without getting tired of it. I don’t think seafood needs to be dressed with sauces or covered up with a heavy batter; the simpler the better! So usually grilled or pan seared is my favorite method of preparing simple, juicy and delicious seafood. This recipe is easy and wonderful; the salmon is cooked in a hot skillet for a very short time, an",
    "ingredients": [
      "Five 5-6 ounce salmon fillets, about 1 inch thick. If the fillets are thicker, add 1-2 minutes to the cooking time per side.",
      "3 TBSP olive oil",
      "3 tsp spice blend (recipe in the illustrated section)",
      "FOR THE STICKY RICE",
      "2 cups fragrant Jasmine rice (washed and drained)",
      "4 cups cold water",
      "1 ½ tsp salt",
      "2 TBSP vegetable oil",
      "½ cup thinly sliced fresh scallions (greens only)",
      "½ cup coarsely chopped fresh parsley",
      "½ cup coarsely chopped fresh cilantro",
      "Five small cubes of unsalted butter",
      "Wedges of lemon"
    ],
    "steps": [
      "FOR HERB RICE: Add 2 cups of rice in a 4-Qt stockpot and wash it by adding enough cold water to cover it, then use your fingers to agitate the rice around in the water. Pour the water out and repeat with more cold water one additional time. Drain as much water as you can. Then add 4 cups of cold water, the herbs, salt and vegetable oil. Bring it to a boil over medium heat.",
      "Reduce the heat to low, stir and cover the stockpot and simmer for about 30 minutes or until the rice is tender.",
      "Remove from the heat. Toss gently with a spatula to fluff up the rice. Cover and keep warm until ready to serve.",
      "FOR SALMON: On a platter arrange the skinless salmon fillets in a single layer. Drizzle 3 TBSP olive oil over the salmon. Use a pair of tongs to flip the fillets and coat the other side with oil. Sprinkle the top with 1 ½ tsp of the spice blend",
      "Preheat a large 12-inch nonstick skillet over medium high heat until very hot.",
      "Place the fillets spice side down on the hot skillet. Immediately sprinkle the rest of the spice on the fillets and close the lid. Cook over medium high heat for 3-4 minutes. Turn off the heat and quickly flip over the fillets. Close the lid immediately and continue cooking with the heat off for another 3-4 minutes, or until the salmon flakes off easily with a fork and you can’t see any translucent dark pink flesh in the center.",
      "Serve with a dab of butter on each fillet, a lemon wedge, side of sticky rice, salad, or steamed vegetables."
    ],
    "minutes": 30,
    "n_ingredients": 13,
    "n_steps": 7,
    "servings": 1,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Rice Dish",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/blackened-salmon-sticky-herb-rice/",
    "scraped_at": "2025-08-28T20:36:40.103234",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_41771e66",
    "name": "BORANI BADEMJAN",
    "description": "",
    "ingredients": [
      "7 Italian eggplants, peeled and cut in half lengthwise",
      "⅓ cup vegetable oil, plus 1 TBSP to coat the aluminum foil",
      "1 large onion sliced thin and fried to golden brown (about 4 ounces fried onions)",
      "3 TBSP vegetable oil",
      "1 TBSP chopped garlic (about 2 cloves)",
      "3 TBSP tomato paste",
      "½ tsp kosher salt",
      "¼ tsp freshly cracked black pepper",
      "1 ¾ cups water",
      "GARNISH:",
      "¾ cup plain low-fat yogurt or nonfat Greek yogurt",
      "1-2 TBSP water as needed",
      "1 small red onion diced small",
      "1 TBSP olive oil",
      "⅓ cup coarsely chopped walnuts",
      "⅛ tsp turmeric powder",
      "2 TBSP chopped fresh mint leaves, optional"
    ],
    "steps": [
      "To bake the eggplants in the oven please refer to the How-To page of my blog. Or if you prefer, fry the peeled eggplants in the skillet until golden brown on both sides.",
      "Meanwhile in a medium skillet fry the sliced onions in 3 TBSP vegetable oil over medium heat until golden brown.",
      "Reduce the heat to low and add the tomato paste. Stir and saute for 4 minutes until fragrant. Add chopped garlic, stir and saute for another 2 minutes.",
      "Add 1 ¾ cup water, ½ tsp salt and ¼ tsp black pepper to the onion mixture and bring it to a boil over medium heat to make a sauce.",
      "Reduce the heat to medium low, add the eggplants, cover and simmer for 20 minutes. Use the back of a spoon to mash the eggplants into small pieces. Cover and simmer for an additional 25 minutes. Most of the liquid should be cooked off and the sauce will be thickened.",
      "Meanwhile in a small skillet fry the diced red onion in 1 TBSP olive oil over medium heat until golden brown. Reduce the heat to low, add turmeric powder and chopped walnuts. Saute for about 5 minutes until fragrant and nutty.",
      "In a small bowl whisk the yogurt until smooth. Add 1-2 TBSP water as needed for a smoother consistency.",
      "Transfer the eggplant dip to a serving platter. Top with the yogurt. Sprinkle the roasted walnut mixture over the yogurt. Sprinkle with chopped fresh mint leaves, if desired. Serve with toasted flat bread."
    ],
    "minutes": 20,
    "n_ingredients": 17,
    "n_steps": 8,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Appetizer",
    "meal_type": [
      "Appetizer"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 0,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/eggplant-yogurt-with-toasted-walnuts-borani-bademjan/",
    "scraped_at": "2025-08-28T20:36:41.695302",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_b34dcd3b",
    "name": "BORANI ESFENAJ برانی اسفناج",
    "description": "Borani Esfenaj is a vegetarian Persian recipe with spinach, walnuts and yogurt. Esfenaj means spinach in Farsi. All the borani dishes in the Persian cuisine are served with yogurt, and Borani Esfenaj is mixed with yogurt before serving. Not too many people are fond of spinach but with all of its vitamins, antioxidants, fiber and iron it is one of the best leafy greens around. I love spinach in most recipes or just by itself, sauteed or steamed. I like spinach in salads or baked in puff pastry, a",
    "ingredients": [
      "1 pound pre washed organic baby spinach leaves",
      "2 TBSP vegetable oil",
      "1 large yellow onion thinly sliced and fried, 4 ounces fried onions",
      "½ tsp garlic granules",
      "½ tsp kosher salt",
      "¼ tsp freshly cracked black pepper",
      "⅛ tsp ground cayenne pepper",
      "¾ cup coarsely chopped walnuts, pea sized",
      "1 cup plain low-fat yogurt",
      "½ cup nonfat Greek yogurt",
      "1 small shallot, diced small and fried to a crisp golden brown for optional garnish",
      "4-5 walnut halves for optional garnish"
    ],
    "steps": [
      "Add the pre washed spinach leaves to a large colander and rinse under cold water. Shake the colander several times to make sure all the water is drained.",
      "Add oil to a 6-Qt stockpot. Add all the spinach to the pot, it will be very full. Do not cover. Cook over medium heat for about 5 minutes. Turn the leaves several times with a spatula, until they all wilt. There will be some liquid in the bottom of the pot.",
      "Add the fried onions, garlic granules, kosher salt, freshly cracked black pepper and cayenne pepper to the wilted spinach and stir to combine. Bring to a low boil over medium heat, then reduce the heat to medium low and simmer without a cover for 10 minutes, or until there is no liquid left in the bottom of the pot.",
      "Add the chopped walnuts and stir to combine. Cook without a cover over medium low heat for 15 minutes, or until it is sizzling and the walnuts are very crunchy and flavorful. Stir occasionally.",
      "Remove the pot from heat and cool the spinach and walnut mixture for 30 minutes on the counter.",
      "Add the plain yogurt and Greek yogurt to spinach mixture and stir to combine.",
      "The dip can be served immediately or chilled in the refrigerator for up to 24 hours.",
      "Before serving the dip sprinkle optional crispy fried shallots and walnut halves on top. Serve with whole grain bread pieces, pita wedges or French baguette croutons."
    ],
    "minutes": 30,
    "n_ingredients": 12,
    "n_steps": 8,
    "servings": 4,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Appetizer",
    "meal_type": [
      "Appetizer"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/spinach-yogurt-dip-with-walnuts/",
    "scraped_at": "2025-08-28T20:36:43.277105",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_e4d15959",
    "name": "BORANI KADOO VA BADEMJAN",
    "description": "Borani Kadoo va Bademjan is a vegetarian dish made with squash (kadoo) and eggplant (bademjan) and slices of fresh tomatoes and garlic. It is served with plain yogurt on the side and the red powder you see on top of the yogurt is a dash of cayenne pepper. This bornai gets its spiciness from serrano peppers that add flavor and heat. If you like more heat add more peppers, or just spice up the yogurt with ground cayenne pepper like I do! If you prefer a less spicy Borani just leave the serrano pep",
    "ingredients": [
      "5 Chinese or Italian eggplants, baked",
      "5 Mexican gray zucchini, or green zucchini, quartered lengthwise unpeeled",
      "⅛ cup vegetable oil",
      "One large onion sliced and fried, (or 4 ounces of fried onions)",
      "3 TBSP vegetable oil",
      "1 ½ TBSP tomato paste",
      "2-3 garlic cloves, peeled and sliced",
      "4-5 small tomatoes, sliced to ¼-inch thick",
      "¼ large green bell pepper (about ½ cup), diced medium",
      "2 serrano peppers, sliced with seeds (optional for added spiciness)",
      "1 cup hot water",
      "1 tsp kosher salt",
      "⅛ tsp freshly cracked black pepper",
      "Side of non-fat Greek yogurt",
      "Sprinkle of cayenne pepper powder on the yogurt for garnish and added flavor"
    ],
    "steps": [
      "Bake the eggplants according to instructions on Baked Eggplants on How To section",
      "Meanwhile add ⅛ cup oil and sliced zucchini to a large nonstick skillet. Cover and brown over medium heat for 15 minutes. Turn the other side, reduce heat to medium low and brown for 10 minutes. Remove from the skillet, set aside.",
      "In the same skillet heat 3 TBSP vegetable oil and fry the sliced onions over medium heat until golden brown.",
      "Add the tomato paste and saute over medium heat for 5 minutes. Add the sliced garlic and saute for another 2 minutes.",
      "Add hot water, 1 tsp kosher salt, and ⅛ tsp black pepper to the skillet and bring it to a boil. If you opt to not use serrano peppers, increase the black pepper to ½ tsp.",
      "Layer the prepared eggplant and zucchini slices in the sauce. Add the tomato slices in a single layer on top. Sprinkle with diced bell pepper and optional sliced serrano peppers.",
      "Cover the skillet and simmer over medium low heat for one hour, or until most of the liquid is cooked off and the sauce has thickened. You may adjust the salt and pepper to your taste anytime during cooking. Occasionally use a spatula to just move the ingredients in the sauce. Do not stir, you want to preserve the layered look.",
      "Use a large spatula to transfer the Borani to a serving platter.",
      "Serve this yummy Borani right away with a bowl of Greek yogurt and a side of Salad Shirazi. I sprinkled the yogurt with just a dash of ground cayenne pepper, but that is only a matter of taste. Traditionally the Borani is served with toasted flat bread, such as Sangak or Lavash, or pita wedges, but it will taste great with crusty French baguette pieces too."
    ],
    "minutes": 90,
    "n_ingredients": 15,
    "n_steps": 9,
    "servings": 5,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Appetizer",
    "meal_type": [
      "Appetizer"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 70,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/borani-kadoo-va-bademjan-zucchini-eggplant-in-tomato-sauce/",
    "scraped_at": "2025-08-28T20:36:45.070488",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_4150810e",
    "name": "BORANI KADOO",
    "description": "Borani Kadoo is zucchini simmered in a garlic tomato sauce. Borani is a vegetarian Persian food with vegetables cooked with different techniques and simmered in different sauces, but they are all served with yogurt on the side. This particular one is called Borani Kadoo; zucchini is kadoo in Farsi. This vegetarian dish may be served at room temperature as an appetizer, or served hot as a meal or side dish. When buying zucchini select small ones with shiny green skin. I leave the skin on because ",
    "ingredients": [
      "4 medium zucchini, unpeeled",
      "2 TBSP vegetable oil",
      "1 medium yellow onion, sliced thin and fried (or 3 ounces fried onions)",
      "2 TBSP tomato paste",
      "1 TBSP chopped garlic (about 2 cloves)",
      "½ tsp kosher salt",
      "¼ tsp freshly cracked black pepper",
      "1 cup boiling water",
      "GARNISH",
      "¼ cup thin shallot slices (about 1 medium shallot)",
      "1 TBSP olive oil",
      "Pinch of ground cayenne pepper",
      "Pinch of ground cinnamon",
      "½ cup plain low fat yogurt, or non-fat Greek yogurt.",
      "1-2 sweet peppers such as Japanese Shishito peppers, sliced thin"
    ],
    "steps": [
      "Cut zucchini into quarters lengthwise.",
      "Add 2 TBSP vegetable oil and the zucchini slices to a large nonstick skillet.",
      "Cover the skillet and place it over medium low heat and brown for 20 minutes.",
      "Turn the other side and brown for another 15 minutes. Keep the skillet covered throughout this step. Remove the fried zucchini slices from the pan and set aside.",
      "In the same skillet heat 3 TBSP vegetable oil. Add the onion slices and fry until golden brown.",
      "Add 2 TBSP tomato paste to the onions, sauté for 5 minutes over medium low heat.",
      "Add the chopped garlic and sauté for one more minute until aromatic.",
      "Add 1 cup boiling water, kosher salt and black pepper to the skillet. Stir and bring to a boil.",
      "Add the browned zucchini slices and arrange them in a single layer in the sauce. Cover and simmer over medium low heat for 30 minutes. Move the zucchini around in the sauce occasionally.",
      "Meanwhile slice a medium shallot very thin and sauté in 1 TBSP olive oil until golden brown and crisp. Remove from the heat and add a pinch each of cayenne pepper and cinnamon and stir.",
      "Add plain or Greek yogurt to a small bowl. Use a whisk or a fork to beat it until it is smooth and has a thinner consistency. You may add 1-2 tsp milk to thin it if needed.",
      "Drizzle some yogurt on the Borani, sprinkle golden fried shallots over the yogurt. Garnish with sliced sweet peppers.",
      "This Borani is served hot as a meal, or served at room temperature as an appetizer.",
      "Serve with your favorite flat bread. Pictured is Sangak that is a traditional Persian flat bread sold in some Middle Eastern supermarkets. Wedges of toasted pita bread is another option."
    ],
    "minutes": 65,
    "n_ingredients": 15,
    "n_steps": 14,
    "servings": 4,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Appetizer",
    "meal_type": [
      "Appetizer"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 45,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/zucchini-in-garlic-tomato-sauce-borani-kadoo/",
    "scraped_at": "2025-08-28T20:36:46.819750",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_7d91086d",
    "name": "BORANI REYHAN",
    "description": "You will love this vegetarian Borani Reyhan. This is a delightful and healthy dish that is made with stewed fresh tomatoes, basil and spinach, with a hint of tangy yogurt cooked into the borani. Borani Reyhan (Reyhan Boranisi in Azeri) is an Azeri/Persian dish that traditionally is made with Reyhan (basil). The type of basil used in this dish is known as the cinnamon basil (also called Thai basil). This species of basil has shiny dark green leaves and purple stems. In comparison to the more comm",
    "ingredients": [
      "4 ounces whole cinnamon basil leaves, no stems",
      "10 ounces baby spinach, chopped roughly",
      "1 large yellow onion, thinly sliced",
      "3 TBSP vegetable oil for frying the onion",
      "1 TBSP tomato paste",
      "5 ounces sliced scallions (about 1 ½ cups)",
      "4 medium ripe Roma tomatoes, diced medium",
      "¾ tsp kosher salt",
      "⅛ tsp freshly cracked black pepper",
      "Dash of ground cayenne pepper",
      "2 large eggs",
      "1 cup plain whole fat yogurt",
      "A pinch of saffron (optional)",
      "Optional garnish:",
      "Grape tomatoes",
      "Fresh basil leaves"
    ],
    "steps": [
      "Remove the stems from fresh basil. Add whole leaves to a bowl of cold water and change the water couple of times. Drain in a colander and set aside.",
      "Clean the scallions, slice to about ¼ inch. Place in a medium bowl and fill with cold water. Change the water a few times to get rid of any possible grit trapped in the scallions. Drain completely in a colander and set aside.",
      "Wash the baby spinach in plenty of cold water to get rid of any grit. Drain in a colander. Chop roughly and set aside.",
      "Dice the Roma tomatoes to medium size cubes and set aside.",
      "In a large nonstick skillet fry the sliced onions until golden brown. Add 1 tablespoon tomato paste to the skillet and saute over low heat for couple of minutes, until aromatic.",
      "Add the sliced scallions and chopped baby spinach to the skillet; stir and saute for 2-3 minutes over medium high heat until wilted. Stirring over high heat prevents the spinach from releasing too much moisture.",
      "Add the diced tomatoes. Add the whole cinnamon basil leaves to the skillet. Add kosher salt and ground peppers. Stir briefly, cover the skillet and simmer over the setting between low and medium low for about 20 minutes. Stir several times. After 20 minutes or so, the tomatoes should be very soft and tender and the liquid will be reduced to a thick sauce that barely covers the bottom of the skillet.",
      "In a medium bowl briefly beat the eggs with a fork. Stir in the yogurt and an optional pinch of saffron. Mix to blend.",
      "Gently pour the yogurt mixture on top of the tomato mixture. Cover the skillet and cook over medium low heat for 5-7 minutes until the eggs are cooked into the sauce. Use a spatula to move the mixture around to prevent sticking to the bottom of the skillet, but leave the yogurt mixture on top intact and let it cook in large pieces.",
      "Borani Reyhan tastes wonderful with lavash, sangak (both are Persian flat breads), Indian naan, or pita bread. Some suggested sides are sabzi khordan (fresh herbs), Salad Shirazi, and fresh sweet or hot peppers."
    ],
    "minutes": 20,
    "n_ingredients": 16,
    "n_steps": 10,
    "servings": 3,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Appetizer",
    "meal_type": [
      "Appetizer"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 0,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/borani-reyhan/",
    "scraped_at": "2025-08-28T20:36:48.587549",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_95f08fdc",
    "name": "BUTTERMILK PANCAKES",
    "description": "These Buttermilk Pancakes are my favorite, they are moist and fluffy and very light. Pancakes should be easy to prepare without too much fuss, after all this is a food that is almost always cooked early in the morning for breakfast and the easier the recipe the better. Pancakes are not exclusively for breakfast though, I can remember a few occasions when my children were little and they thought pancakes for dinner was just the coolest thing ever! I think every once in a while pancakes, eggs, and",
    "ingredients": [
      "1 ½ cups all-purpose flour",
      "3 ½ tsp baking powder",
      "¾ tsp salt",
      "1 TBSP sugar",
      "⅛ tsp pure vanilla powder, or ½ tsp pure vanilla extract",
      "¾ cup buttermilk",
      "½ cup milk. I use 1% fat milk",
      "1 large egg",
      "3 TBSP (1 ½ ounces) sweet butter, melted",
      "Maple syrup"
    ],
    "steps": [
      "In a large bowl sift flour, baking powder, salt, vanilla powder and granulated sugar. Set aside.",
      "In a medium bowl beat the egg briefly then add buttermilk and milk and whisk them together until smooth. Set aside. (If using vanilla extract add it to this mixture)",
      "Gradually work the wet ingredients and melted butter into the dry ingredients and mix with a wooden spoon until well combined but lumpy.",
      "Grease the griddle or a large nonstick skillet lightly with butter and heat it over medium heat. You will probably need to grease the griddle only for the first batch because the butter in the mix is usually sufficient for cooking the rest of the pancakes, but you may add a little bit more butter if needed.",
      "Pour the batter over the hot griddle using ¼ measuring cup. Leave plenty of space between the pancakes.",
      "Cook the pancakes over medium heat. Do not turn the pancakes until small air pockets form and pop on the surface, then flip the pancakes with a large flat spatula so the other side browns. Transfer the cooked pancakes to the serving platter and keep warm until all of them are cooked. Once you have made the first batch if you notice that the pancakes are browning too fast, you may reduce the heat just a little bit.",
      "Serve the pancakes with warm maple syrup and fresh berries or other fruit."
    ],
    "minutes": 60,
    "n_ingredients": 10,
    "n_steps": 7,
    "servings": 4,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": 40,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/buttermilk-pancakes/",
    "scraped_at": "2025-08-28T20:36:50.330360",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_9446f4c3",
    "name": "CARAMELIZED WALNUTS",
    "description": "Fall baking and nuts go together and these Caramelized Walnuts are fun to make and wonderful to munch on. They are also great for topping cakes or cupcakes. If you have had caramelized nuts at the county fairs, you’re going to love how easy it is to make them. I love different nuts in all forms: Raw, roasted, smoked, salted, unsalted, and of course caramelized. My love of nuts has been with me since I was a little girl growing up in Tabriz, Iran. Iran has some of the best nuts in the world. Pers",
    "ingredients": [
      "1½ cups walnut halves",
      "⅓ cup + 1 TBSP granulated sugar",
      "1½ tsp ground cinnamon",
      "⅛ cup water"
    ],
    "steps": [
      "Add all of the ingredients to a medium nonstick skillet and stir over medium low heat until all the sugar dissolves and the syrup starts bubbling.",
      "Keep stirring for about 8 minutes, or until all the water cooks off and the sugar that has coated the walnuts starts to crystallize.",
      "Continue stirring for another 7-8 minutes until the crystalized sugar starts to melt.",
      "When all the walnuts are caramelized and shiny, remove the skillet from heat and spread the walnuts on an aluminum foil to cool over the counter. Don’t get tempted to try one before completely cooled, they will be very hot!",
      "These walnuts make a great snack, also are perfect for topping cakes or cupcakes.",
      "Store the cooled Caramelized Walnuts in an airtight container at room temperature for up to a week."
    ],
    "minutes": 8,
    "n_ingredients": 4,
    "n_steps": 6,
    "servings": 1,
    "difficulty": "Medium",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -12,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/caramelized-walnuts/",
    "scraped_at": "2025-08-28T20:36:52.053238",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  },
  {
    "id": "pm_5094327c",
    "name": "CARROT CAKE - CAKE HAVIJ",
    "description": "Fall made its arrival last week in the Northern Hemisphere with shorter daylight hours and cooler temperatures in most areas. In my corner of the world fall brings a magnificent display of yellow, orange and crimson colors and the crisp mountain air makes me crave for spices, hot cider and a warm blanket. While this is the beautiful picturesque season for some of us, it is a very busy harvest season for the hardworking farmers who have had to fight the elements with sheer anxiety for the past se",
    "ingredients": [
      "FOR THE CAKE:",
      "2 cups all-purpose flour",
      "1 ½ cups granulated sugar",
      "2 tsp baking soda",
      "2 tsp ground cinnamon",
      "½ tsp salt",
      "½ tsp ground ginger",
      "¾ cup mayonnaise",
      "3 large eggs, room temperature",
      "1 (8 - ounce) can crushed pineapple with syrup",
      "2 cups finely grated carrots (about 4 medium carrots, peeled)",
      "¾ cup pea-sized chopped walnuts",
      "FOR THE MAPLE CREAM CHEESE FROSTING:",
      "Two 8-ounce packages cream cheese, room temperature",
      "4 TBSP granulated sugar",
      "½ tsp pure vanilla extract",
      "⅓ cup plus 2 TBSP (about 3 ounces) maple syrup",
      "FOR GARNISH:",
      "8-12 Caramelized Walnuts plus some for crushing over the top (may also substitute with plain walnut halves plus some chopped walnuts for the top)"
    ],
    "steps": [
      "To make the cake: Preheat the oven to 350 F. Prepare the pans. Add all the cake ingredients, except for the grated carrots and chopped walnuts, into the large bowl of a stand mixer.",
      "With the whisk attachment and the mixer set on low speed mix the ingredients for 30 seconds to combine the wet and dry ingredients well.",
      "Increase the speed to medium and mix the ingredients for 3 minutes, stopping to scrape the sides once.",
      "Stir in the carrots and walnuts with a wooden spoon. Pour as evenly as you can into two prepared pans; I used two 8-inch round pans.",
      "Bake the cakes on the center rack of the preheated 350 F oven, 40-45 minutes for 8-inch round pans and 30-35 minutes for 9-inch round pans, or until a toothpick inserted in the center of the cakes comes out clean.",
      "Cool the cakes in the pans on a cooling rack for 10 minutes. Remove the cakes by inverting onto cooling rack, top sides down. This is to get rid of some of the dome that might form during baking. Cool completely before frosting (about 1 ½ hours).",
      "To make the Maple Cream Cheese Frosting: Use the beater attachment and a clean mixing bowl to beat the softened cream cheese and 4 TBSP sugar on medium speed until fluffy and smooth.",
      "With the mixer running add the vanilla extract and drizzle the maple syrup slowly. Beat to blend for another minute.",
      "To assemble the cake: Fit a pastry bag with a star tip and fill with about 1 cup of the frosting.",
      "Place one cake on a cake stand or plate with bottom side up. Pipe the Maple Cream Cheese Frosting around the border of the cake, then use a spatula to add half of the remaining frosting in the center of the cake and use an offset spatula to spread it evenly.",
      "Place the second cake with the top side up on the frosting.",
      "Frost the top with the remaining frosting and pipe out 8-12 rosettes and top them with Caramelized Walnuts.",
      "Crush extra Caramelized Walnuts to sprinkle on top.",
      "Pipe more decorations around the bottom of the cake.",
      "Serve with a glass of tea or a cup of coffee."
    ],
    "minutes": 10,
    "n_ingredients": 19,
    "n_steps": 15,
    "servings": 8,
    "difficulty": "Hard",
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "tags": [
      "Persian",
      "Iranian",
      "Middle Eastern",
      "PersianMama"
    ],
    "primary_category": "Main Course",
    "meal_type": [
      "Dinner",
      "Lunch"
    ],
    "nutrition": {
      "calories": null,
      "protein": null,
      "carbohydrates": null,
      "fat": null,
      "fiber": null,
      "sugar": null,
      "sodium": null,
      "cholesterol": null,
      "saturated_fat": null
    },
    "prep_minutes": 20,
    "cook_minutes": -10,
    "api_source": "Scraped",
    "source_name": "PersianMama",
    "source_url": "https://persianmama.com/carrot-cake-cake-havij/",
    "scraped_at": "2025-08-28T20:36:53.789443",
    "popularity": 100,
    "health_score": null,
    "price_per_serving": null,
    "image": null,
    "spoonacular_id": null,
    "spoonacular_score": null,
    "spoonacular_url": null,
    "diet": [],
    "health_category": [],
    "occasion": [],
    "cooking_method": []
  }
]