[
  {
    "id": "turmeric_d2172d42",
    "name": "Persian Lamb Stew with Black-Eyed Peas and Herbs",
    "description": "Traditional Persian stew: Persian Lamb Stew with Black-Eyed Peas and Herbs",
    "ingredients": [
      "dried fenugreek",
      "limoo amani"
    ],
    "steps": [
      "In a large soup pot place the shanks, add 8 cups of water, bring to a boil over medium-high heat. Skim foam as they come to the surface.",
      "Add turmeric, onions, beans, dried limes, cinnamon, salt, and pepper. Cover and cook on medium heat for an hour.",
      "Add the herbs and potatoes. Add a little water if needed. Cover and continue cooking for another 30-40 minutes or until the meat is fully cooked. Taste and adjust the seasoning.",
      "Ladle the broth into a servings bowl and put the گوشت کوبیده - mashed meat onto a platter.",
      "Serve hot with warm bread, sabzi khordan, and torshi."
    ],
    "minutes": 40,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2014/01/abgousht-bozbash-persian-lamb-stew-with.html"
  },
  {
    "id": "turmeric_13482a8e",
    "name": "e Jo - Barley Stew with Beans and Herbs",
    "description": "Traditional Persian stew: e Jo - Barley Stew with Beans and Herbs",
    "ingredients": [
      "Toppings:"
    ],
    "steps": [
      "In a large stew pot, place barley, chickpeas, beans, lentils and add 6 cups of water. Bring to a boil on medium-high heat, then reduce the heat to medium-low and cook for 1 1/2 hours or until beans are tender, stirring occasionally. \nAdd the chopped vegetables, salt, and pepper. Add more water if necessary. \nCook for another 30 minutes on low heat. Taste and adjust the seasoning.\nIn the meantime, in a small pan heat 3 tablespoons oil over medium high heat, saute onions until golden brown. add turmeric and stir well. Add dried mint and remove from heat. Set aside."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2010/01/barley-stew-with-beans-herbs-ash-e-jo.html"
  },
  {
    "id": "turmeric_68e123cb",
    "name": "Dopiazeh",
    "description": "Traditional Persian stew: Dopiazeh",
    "ingredients": [
      "1 pound ground beef, lamb or turkey",
      "2 large onions, peeled and finely chopped",
      "3 garlic cloves, minced",
      "4 medium-sized potatoes, washed, peeled and cut into small pieces",
      "2 tablespoons tomato paste",
      "1/2 teaspoon turmeric"
    ],
    "steps": [
      "In non-stick skillet, heat 3 tablespoons of oil on medium heat, add the chopped onions, saute until golden brown. Take half of the the fried onions and set aside.",
      "Add turmeric, stir, add the garlic and fry for two minutes.",
      "Add the ground beef, cook until brown. Add the tomato paste and cook for another 5 minutes, add salt, pepper and a pinch of red pepper. Add 1/2 cup of water. Stir.",
      "Add the cubed potatoes and the remaining fried onions to the beef and potato mixture. Stir well, cover and cook on low heat for 30 minutes. Taste and adjust the seasoning.",
      "Serve warm with rice or warm bread and salad shirazi."
    ],
    "minutes": 5,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2009/10/dopiazeh.html"
  },
  {
    "id": "turmeric_0870cc42",
    "name": "Pomegranate Walnut & Chicken Stew",
    "description": "Traditional Persian stew: Pomegranate Walnut & Chicken Stew",
    "ingredients": [
      "4 boneless, skinless chicken breasts, cut into small chunks-1 large onion, peeled, minced-2 cups shelled walnuts, finely ground-1 cup pomegranate molasses, plus more if needed-1/4 cup sugar, plus more if needed-Dash of cinnamon  -Vegetable oil-Salt and pepper to taste"
    ],
    "steps": [
      "Pulse the walnuts a few times in a food processor until finely ground. In a small pan, heat 2 tablespoons of oil over medium heat. Add the walnuts and sauté them lightly for 2-3 minutes, stirring often.\nAdd the pomegranate molasses and 2 cups of water to the pan. Mix well, cover with the lid slightly ajar, and simmer over low heat for 30-40 minutes. \nIn a large heavy-bottomed pot, heat 2 tablespoons of oil over medium heat. Sauté the onions until golden brown.\nAdd the chicken pieces to the pot and cook until golden on all sides. Add salt, pepper, and a small dash of cinnamon. Start with 1/2 teaspoon of salt; you can adjust later.)\nPour the pomegranate-walnut mixture into the pot with the chicken. Stir well, adding water if needed, so the chicken is fully covered, and brought back to a boil. Then reduce the heat to low, cover, and simmer for 2 hours. The slow cooking allows the chicken, walnuts, and pomegranate sauce to become rich and creamy.\nAdd sugar 1 tablespoon at a time, mixing gently without breaking up the chicken. Taste and adjust to your preference. Fesenjoon is traditionally a balanced, sweet-and-sour (malas) dish. I personally prefer it more sour. But many enjoy it sweeter.\nIf the fesenjoon is too thin, leave the lid slightly ajar and simmer until it reaches a thick consistency. Fesenjoon should never be watery."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2009/12/fesenjoon-pomegranate-walnut-chicken.html"
  },
  {
    "id": "turmeric_10cf2ca4",
    "name": "Southern Iranian Spicy Fish & Herb Stew",
    "description": "Traditional Persian stew: Southern Iranian Spicy Fish & Herb Stew",
    "ingredients": [
      "tamarind concentrate"
    ],
    "steps": [
      "Place the tamarind in a small bowl, add 1 cup of hot water and soak for 20 minutes. When the water becomes cool enough to touch, separate and remove the seeds and pass the liquid through a sieve. Set aside.In a small bowl combine the flour with 1/2 teaspoon of turmeric, 1/2 teaspoon salt, 1/4 teaspoon black pepper, and 1/2 teaspoon red pepper. Generously coat the fish with the flour-turmeric mixture and set aside for 10-15 minutes.  Dust off any excess flour before frying the fish.\nHeat 3 tablespoons of vegetable oil in a skillet and lightly saute the fish pieces on all sides on medium heat. Set aside.\nIn a large pan saute chopped onions in 3 tablespoons of hot oil until translucent on medium-high heat. Stir in 1/2 teaspoon of turmeric powder and the minced garlic, and cook for another couple of minutes on medium-low heat.\nAdd the freshly chopped herbs to the pan, and saute along with the onion and garlic for about 10 minutes on medium heat.\nPour in the tamarind sauce, and simmer on medium-low heat until all flavors come together for about 15-20 minutes.\nGently place the fish in the stew, add salt, pepper and red pepper to taste. Add a little more hot water to the stew if needed. Taste and adjust the seasoning. Cover and cook for another 20 minutes on low heat. Do not stir the stew.\nServe warm with basmati rice.\n\n\n\nEnjoy!"
    ],
    "minutes": 20,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2012/04/ghalieh-mahi-southern-iranian-spicy.html"
  },
  {
    "id": "turmeric_0d3c6dee",
    "name": "Persian Herb Stew",
    "description": "Traditional Persian stew: Persian Herb Stew",
    "ingredients": [
      "2 pounds lamb or beef, washed and cubed- 1 cup red kidney beans or pinto beans, soaked overnight - 1 large yellow onion, finely chopped- 4 bunches flat-leaf parsley- 1 bunch cilantro- 2 large leeks or 4 scallions (green stems only)- 1 small bunch fresh fenugreek, or 1 tablespoon dried fenugreek (shanbalileh), too much fenugreek will make the stew bitter- 3-4 dried lemons (limoo amani), pierce each lemon a few times with a fork- 1 teaspoon turmeric-Salt and pepper, to taste"
    ],
    "steps": [
      "Clean, wash, and dry the herbs. Finely chop the parsley, cilantro, leeks/scallions, and fenugreek.",
      "Heat 1/3 cup vegetable oil in a large skillet over medium heat. Add the chopped herbs and saute for about 15 minutes, stirring frequently. Set aside.",
      "In a large stew pot, heat 2 tablespoons of oil. Add the chopped onions and saute until golden brown.",
      "Add cubed meat, turmeric, salt, and pepper. Cook until brown on all sides.",
      "Add the soaked beans, sauteed herbs, and dried lemons.",
      "Pour in enough water to cover the mixture by about 2 inches. Bring to a boil for a few minutes, then reduce the heat to medium-low. Cover, and cook on medium to low heat for 1 1/2 hours.",
      "Taste and adjust the seasoning. Add more water if needed. Lower the heat and let the stew gently simmer for another 30 minutes. Ghormeh sabzi tastes better when it simmers longer ( khoob ja miofteh) and is often more flavorful the next day.",
      "Serve hot with basmati rice, salad shirazi, and mast o khiar."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2008/12/ghormeh-sabzi-persian-herb-stew.html"
  },
  {
    "id": "turmeric_59776d55",
    "name": "Eggplant Stew",
    "description": "Traditional Persian stew: Eggplant Stew",
    "ingredients": [
      "dried lime",
      "ground sour grapes"
    ],
    "steps": [
      "Place the salted eggplant slices in a large container of water. Weigh them down with a heavy lid or bowl to keep them submerged for 10 minutes. Drain, pat dry, and set aside.  \nHeat 1/2 cup of oil in a large skillet over medium-high heat. Fry the eggplant slices until golden brown on both sides. Transfer to a paper towel-lined plate to absorb excess oil. \nGently place tomatoes in boiling water for about 1-2 minutes, then transfer to a bowl of ice water. Once cool, peel off the skins and chop.\nHeat 3 tablespoons of oil in a large saucepan over medium-high heat. Sauté chopped onions until soft and translucent. Add garlic and cook for about 2 minutes. Stir in turmeric, lamb cubes, salt, and pepper. Mix thoroughly. Cook until the meat is brown on all sides.  \nAdd chopped tomatoes, tomato sauce, and enough water to cover the ingredients by an inch. Bring back to a boil, reduce the heat, cover, and cook for 40-50 minutes.  \nAdd fried eggplants and dried limes. Add more water if needed. \nCover and cook for another 20 minutes or until the meat is tender. \nAdd lime juice or verjuice and cinnamon, cover, and simmer for another 15 minutes on low heat, allowing all the flavors to blend.."
    ],
    "minutes": 10,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2009/03/eggplant-stew-khoresh-bademjan.html"
  },
  {
    "id": "turmeric_1809e73a",
    "name": "e Bamieh-o-Bademjan - Eggplant and Okra Stew",
    "description": "Traditional Persian stew: e Bamieh-o-Bademjan - Eggplant and Okra Stew",
    "ingredients": [
      "Eggplant is widely used in Persian cuisine, for instance some popular dishes include  khoresh bademjan, borani bademjan,  and kashke-bademjan . Whereas okra on the other hand, is mostly sauteed and cooked in khoresh bamieh, a popular southern dish. In our home my mother always made khoresh bamieh with tamarind sauce and the taste was so incredibly amazing that I haven't tried to change my mother's recipe and use any other sauce instead. However, since I'm adding eggplant to this dish I'll use a couple tablespoons of tomato paste and a large tomato as a base with the addition of lime juice.",
      "1 1/2 pound meat (lamb or beef), washed, trimmed and cubed",
      "8 small size eggplant, peeled, leave whole or cut in half",
      "1 pound okra, wash and trim the top",
      "1-2 large tomatoes, skin removed and finely diced",
      "2 large onions, finely chopped",
      "2-3 garlic cloves, minced",
      "2-3 freshly squeezed lime juice",
      "2 tablespoons tomato paste",
      "1 teaspoon turmeric"
    ],
    "steps": [
      "Place peeled eggplant in a colander, sprinkle with salt and let them drain for a couple of hours before cooking.\nHeat 1/2 a cup of vegetable oil in a large skillet over medium-high heat and fry the eggplants until golden brown. Remove and place fried eggplant on a paper towel.\nIn the same skillet fry okra in 2-3 tablespoons of oil on medium heat until lightly brown. Set aside.\nIn a large stew pot saute the chopped onions on medium-high heat until golden brown. Add a teaspoon of turmeric powder. Stir well, add the minced garlic and saute for another few minutes. \nAdd the meat, salt, pepper and brown the meat on all sides.\nAdd the chopped tomatoes, tomato paste and add enough water to cover the meat by a couple of inches. Bring to a boil, reduce the heat, cover and cook for an hour on medium-low heat or until the meat is tender.\nAdd the lime juice to the stew, stir and gently place the fried eggplant and okra in the pot. Taste and adjust the seasoning with salt, pepper and lime juice. Add a little more water if necessary. Cover and simmer for another 30-40 minutes on low heat."
    ],
    "minutes": 40,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2012/02/khoresh-e-bamieh-o-bademjan-eggplant.html"
  },
  {
    "id": "turmeric_6d5c7af3",
    "name": "Southern Iranian Okra Stew with Tamarind",
    "description": "Traditional Persian stew: Southern Iranian Okra Stew with Tamarind",
    "ingredients": [
      "1 pound meat (lamb or beef), cubed",
      "1 pound whole baby okra (fresh or frozen), wash and trim",
      "1 cup tamarind sauce* (recipe at the bottom)",
      "1 teaspoon tomato paste",
      "1 large onion, thinly sliced",
      "7-9 garlic cloves, minced (use more if desired)",
      "1 teaspoon red pepper (use more if desired)",
      "1/2 teaspoon ground black pepper",
      "1/2 teaspoon turmeric",
      "Salt to taste",
      "Oil for frying",
      "*Tamarind Sauce:",
      "Place 7 ounces of tamarind paste with pods in a bowl.",
      "Cover with 1-2 cups of hot water for an hour to soften.",
      "Then with a spoon/fork or your fingers try to get the pods separated from the pulp and get the juice out.",
      "Add more warm water if needed.",
      "Discard the seeds and strings.",
      "Pour the tamarind liquid in a jar with a tight-fitting lid and store it in a cool and dry place."
    ],
    "steps": [
      "In a large stew pot, heat 3 tablespoons of oil and saute onions on medium heat until golden. Add turmeric and garlic, saute for about 5 minutes.\nAdd the meat and brown on all sides. Add salt and pepper to taste.\nAdd 5 cups of water, bring to a boil on medium-high heat. Lower heat, cover and cook for 45-50 minutes or until meat is tender. Add water if needed.\nIn a separate skillet, heat 2 tablespoons of oil, saute okra lightly over medium heat for five minutes. Remove from the pan and set aside.\nIn the same skillet heat a tablespoon of oil, add the tomato paste and cook for a couple of minutes over medium-low heat.\nAdd the tomato sauce and tamarind sauce to the stew pot, simmer for another 5-7 minutes over medium-low heat.\nAdd the fried okras to the stew pot and cook for an additional 20 minutes to soak up the flavors.\nTaste and adjust seasoning.",
      "Serve hot with rice, yogurt, herbs, and bread."
    ],
    "minutes": 5,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2010/04/southern-iranian-okra-stew-with.html"
  },
  {
    "id": "turmeric_aa1ffd66",
    "name": "e Beh - Quince Stew",
    "description": "Traditional Persian stew: e Beh - Quince Stew",
    "ingredients": [
      "2 pounds meat (lamb or beef), washed and cubed",
      "4  medium-size quince, washed, cored and sliced (could be cubed too), slice right before cooking.",
      "1 cup yellow split peas, picked over and rinsed",
      "1 large onion, peeled and chopped",
      "2 -3 tablespoons tomato paste",
      "1/4 teaspoon turmeric",
      "1/2 teaspoon liquid saffron",
      "2-3 dried lemons (limoo amani) or juice of a lime",
      "2 tablespoons sugar",
      "2 cups of water"
    ],
    "steps": [
      "Heat 3 tablespoons oil in a large heavy-bottomed pot over medium-high heat. \nAdd chopped onion and cook until golden brown, add turmeric powder and stir.\nPlace the meat in the pot and brown on all sides. \nAdd the tomato paste and cook for five minutes. Stir.\nAdd the peas to the pot and give it a gentle stir, cook for 3-5 minutes.\nAdd cinnamon, saffron, dried lemons salt and pepper.\nPour water in the pot, bring to a boil, then lower the heat, cover and cook on a medium to low heat for an hour.\nHeat 2-3 tablespoons of oil in a skillet and cook the slices of quince for 7-10 minutes over medium heat.\nSprinkle sugar over quince slices and stir well till sugar is completely dissolved. Set aside.\nIn an ovenproof casserole dish, pour in the meat mixture, adjust the seasoning and gently layer the cooked quince slices on top. \nCook in the 350 degrees Fahrenheit preheated oven for 50 minutes."
    ],
    "minutes": 5,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2009/12/quince-stew-khoresh-beh.html"
  },
  {
    "id": "turmeric_97fde61b",
    "name": "Green Almond Stew",
    "description": "Traditional Persian stew: Green Almond Stew",
    "ingredients": [
      "1 pound stew meat (lamb or beef), cubed",
      "1 pound green almonds, soaked in cool water for 6-8 hours or overnight, drain, use a paper towel to remove the fuzz (you may also slice the green almonds if you like)",
      "3 cups chopped fresh flat-leaf parsley",
      "1/2 cup chopped fresh mint",
      "1-2 tablespoons dried mint (for added aroma and flavor)",
      "1 large onion, finely chopped",
      "1/2 teaspoon turmeric",
      "2-3 tablespoons lime juice, freshly squeezed (you may use verjuice instead)"
    ],
    "steps": [
      "In a large pan, heat 3 tablespoons of vegetable oil over medium-high heat and saute the chopped onions until soft and golden. Add the turmeric powder, stir well.\nAdd the meat to the pan, stirring occasionally, and cook until brown on all sides. Add salt and pepper to taste.\nAdd 3 cups of water or enough to cover the beef. Bring back to boil, cover, reduce heat, and simmer gently for 45 minutes.\nAdd the green almonds, parsley, fresh mint, and dried mint. Add a little water if needed. Cover and cook for another 45 minutes over low heat. Add in the lime juice and continue cooking on low heat for another 10-15 minutes.",
      "Serve the khoresh warm with polow, mast o khiar, and salad Shirazi."
    ],
    "minutes": 480,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2016/04/khoresh-chaghaleh-badoom-green-almond.html"
  },
  {
    "id": "turmeric_88a7194c",
    "name": "Khoresh Gheymeh: A Traditional Iranian Dish with Meat and Yellow Split Peas",
    "description": "Traditional Persian stew: Khoresh Gheymeh: A Traditional Iranian Dish with Meat and Yellow Split Peas",
    "ingredients": [
      "2 pounds of lamb or beef, rinsed and cut into small pieces-1 cup yellow split peas, picked over and washed.-1 large onion, peeled and chopped -2-3 tablespoons tomato paste -4-5 dried limes (limoo amani), soaked for 5 minutes, then pierced with a fork.-1/2 teaspoon turmeric-A pinch of cinnamon-1 teaspoon rosewater *optional-Salt and pepper to taste-Vegetable oil-2 large potatoes, peeled, sliced, and fried for topping"
    ],
    "steps": [
      "Heat 1 tablespoon of oil in a small saucepan over medium heat. Add tomato paste and saute for 2-3 minutes, stirring frequently, until it darkens slightly. Set aside.\nIn a large pot, heat 3 tablespoons of oil over medium heat. Add the onions and saute until translucent. Stir in the turmeric and cook for another minute. Add the meat and brown it on all sides. Season with salt, pepper, and a pinch of cinnamon.  \nStir in the yellow split peas and saute for about 5 minutes. Add the tomato paste and mix well. \nPour in enough water to cover the ingredients by 1-2 inches. Add the dried limes. Bring to a boil, then reduce the heat, cover, and simmer for about 1 1/2 to 2 hours or until the meat is tender.  Add water if needed and adjust seasoning to taste. \nThe split peas should be tender but still hold their shape. To ensure this, you can parboil them separately until just tender and add them during the last 30-40 minutes of cooking.\nIn the last ten minutes, stir in the rosewater if using."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2010/03/khoresh-ghaymeh-traditional-iranian.html"
  },
  {
    "id": "turmeric_cc7af8e8",
    "name": "Iranian Lamb and Yellow Split Pea Stew with Zucchini",
    "description": "Traditional Persian stew: Iranian Lamb and Yellow Split Pea Stew with Zucchini",
    "ingredients": [
      "yellow split peas",
      "limoo amani"
    ],
    "steps": [
      "Rinse yellow split peas, place in a pot, add 3 cups of water, add a small stick of cinnamon and bring to a boil over medium-high heat. Reduce the heat, cook for 30 minutes over medium-low heat or until tender and remove foam as it cooks. Set aside. Remove the cinnamon stick.\nHeat 3 tablespoons of oil in a frying pan. Fry the zucchini until golden brown. Remove from pan and set aside.\nHeat 3 tablespoons of oil in a pan over medium-high heat. Add the sliced onion, saute until soft and transparent. Add a pinch of salt and the turmeric powder, stir. Add the minced garlic and saute for another couple of minutes.\nAdd the meat and 1/2 teaspoon black pepper and thoroughly brown on all sides.\nSpoon in the tomato paste in the center of the pot, cook for 2-3 minutes until the tomato paste changes color.\nAdd the diced tomatoes, yellow split peas, limoo amani, 1 teaspoon salt, a pinch of red pepper and enough water to cover the stew by a couple of inches. Bring to a boil, reduce heat, cover and cook for 30 minutes. \nLayer zucchini slices or whole baby zucchini on top of the gheymeh. Add a little more water if needed. Cover and cook for another 30 minutes over low heat until the meat and the peas are fully cooked and the flavors come together. \nTaste and adjust the seasoning. Stir in the juice of lime or lemon if you like.",
      "Serve warm with rice, mast o khiar, salad shirazi, and sabzi khordan.\n\nEnjoy!"
    ],
    "minutes": 30,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2017/11/khoresh-gheymeh-kadoo-sabz-iranian-lamb.html"
  },
  {
    "id": "turmeric_3cb9b55e",
    "name": "e Kadoo - Gray Squash Lamb Stew",
    "description": "Traditional Persian stew: e Kadoo - Gray Squash Lamb Stew",
    "ingredients": [
      "1 1/2 pounds meat (lamb or beef), wash, cut in cubes 7 gray squash or zucchini, wash, peel, cut in half, you may leave the skin on",
      "2 large tomatoes, remove skin and finely chop/or use a can of crushed tomatoes",
      "2 tablespoons tomato paste",
      "1 large onion, peeled, thinly sliced",
      "2-3 cloves of garlic, peeled, finely chopped",
      "1/3 teaspoon turmeric",
      "3-4 crushed or whole dried lemons (limoo amani) or juice of 1-2 lemons depending on your taste1/3 teaspoon cinnamon  Salt and pepper to taste"
    ],
    "steps": [
      "Heat 3 tablespoons oil in a frying pan, fry the squash slices over medium heat until golden brown on both sides. Set aside.\nHeat 2 tablespoons oil in a pan, saute sliced onions over medium heat until translucent, add the turmeric powder and garlic, stir and saute for another 2-3 minutes. \nAdd the meat, brown on all sides, add cinnamon, salt and pepper. \nAdd the tomato paste, cook for five minutes, add the crushed tomatoes. \nAdd water to cover the ingredients by a couple of inches and add limoo amani. Bring to a rapid boil, lower the heat to medium low, cover and cook for an hour or until meat is tender. \nAdd water if needed. If you are using lemon juice, add it after the meat becomes tender.\nIn an oven-proof dish, place half of the meat sauce and add a layer of the fried squash, repeat. Taste and adjust the seasoning, cover with a foil and cook for 40 minutes in the 350 degrees Fahrenheit preheated oven."
    ],
    "minutes": 3,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2010/02/lamb-stew-with-gray-squash-and-tomato.html"
  },
  {
    "id": "turmeric_d3163bdf",
    "name": "Persian Beef and Pumpkin Stew",
    "description": "Traditional Persian stew: Persian Beef and Pumpkin Stew",
    "ingredients": [
      "aloo bokhara"
    ],
    "steps": [
      "In a large skillet heat 2-3 tablespoons of oil, add pumpkin and saute lightly for about 7 minutes.\nStir in cinnamon, a pinch of nutmeg, and a dash of salt. Cook for another 5 minutes. Set aside. \nIn a large pan heat 3 tablespoons of oil, add sliced onions, and saute over medium-high heat until golden. Add minced garlic and saute for a couple of minutes. Add the turmeric powder, stir and mix well.\nAdd beef and cook until brown on all sides, stirring occasionally.\nAdd chopped tomatoes, tomato sauce, 1 teaspoon salt, and 1/2 teaspoon pepper. Add water to cover all ingredients by about an inch, mix well. Bring to a boil on high heat, lower the heat, cover and cook over medium heat for about 45 minutes or until tender.\nAdd the sauteed pumpkins, potato, and carrots to the stew. Add a little bit of water if necessary. Cover and cook for another 30 minutes over low heat. Add in the plums, lemon juice, and sugar. Stir well, taste and adjust the seasoning, simmer for another 10-15 minutes. \n\n\nServe hot with rice, mast o khiar, and sabzi khordan."
    ],
    "minutes": 7,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2014/11/khoresh-kadoo-halvaie-persian-beef-and.html"
  },
  {
    "id": "turmeric_801dbb65",
    "name": "Celery Stew",
    "description": "Traditional Persian stew: Celery Stew",
    "ingredients": [
      "1 pound beef or lamb, washed and cut into cubes-1 large onion, peeled and chopped-1 head of celery, washed, cut into 1-inch pieces-2 bunches fresh flat-leaf parsley, finely chopped -1 bunch fresh mint, finely chopped, or 2-3 tablespoons dried mint-2 large garlic cloves, minced-2-3 tablespoons freshly squeezed lemon juice (adjust to taste) -1/2 teaspoon turmeric-Salt and pepper, to taste-Vegetable oil"
    ],
    "steps": [
      "In a large pot, heat 3 tablespoons of oil over medium-high heat. Add chopped onions and cook until golden. Stir in the minced garlic and saute for 2-3 minutes more. \nAdd turmeric and the meat to the pot, and brown the meat on all sides. Season with salt and pepper.  \nPour in 2-3 cups of water, bring to a boil, then reduce the heat to medium-low, cover, and cook for about 30-40 minutes.\nIn a large frying pan, heat 2-3 tablespoons of oil over medium-high heat. Sauté the celery pieces until softened. Add the parsley and mint; stir well and sauté for another 4-5 minutes.\nAdd the sauteed vegetables to the pot with the meat. Adjust seasoning and water level, if necessary. Cover and simmer for 1 1/2 hours, until the meat is tender.\nStir in lemon juice toward the end of cooking."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2009/05/celery-stew-khoresh-karafs.html"
  },
  {
    "id": "turmeric_817b24e4",
    "name": "e Khalal Badam & Zereshk - Slivered Almonds & Barberry Stew",
    "description": "Traditional Persian stew: e Khalal Badam & Zereshk - Slivered Almonds & Barberry Stew",
    "ingredients": [
      "Salt and pepper to taste"
    ],
    "steps": [
      "Lightly toast the almond slivers in a dry pan for 3-5 minutes over medium to low heat. Set aside\nIn a small frying pan lightly saute the barberries in 1-2 tablespoons of oil over medium heat for a few minutes. Set aside.\nIn a small pan saute the tomato paste in a tablespoon of oil for 2-3 minutes over medium heat. Set aside. This step is optional but it improves the taste of the stew.\nHeat 2-3 tablespoons of oil in a large pot, saute the sliced onion over medium heat until translucent, add the garlic and saute for another 2-3 minutes then add the turmeric. Stir well to blend every bit of onion and garlic with turmeric powder.\nAdd the meat and brown on all sides. Add cinnamon, salt and pepper to taste, blend well.  \nMake some room in the center of the pot by pushing the meat and onion mixture to the side of the pot and place the split peas in the center and fry them for a few minutes. This will harden the peas and gets rid of their raw smell. You may also cook the split peas separately with two cups of water and add them to the stew half way through cooking if you prefer. \nScoop in the tomato paste and pour in enough water to cover meat and to come about two inches above. \nCover and cook for 30 minutes on medium to low heat, add the almond slivers, mix well, cook and cover for another 20 minutes. Add water if needed.\nAdd barberries and saffron, stir well, taste and adjust seasoning. Cook for another 20-30 minutes until meat is tender and the flavors are well blended. Pour rose water in the last 10 minutes of cooking.",
      "Serve warm with rice, pickles (torshi), fresh herbs and yogurt."
    ],
    "minutes": 5,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2010/08/slivered-almonds-barberry-stew-khoresh.html"
  },
  {
    "id": "turmeric_ae52577c",
    "name": "e Loobia Sabz - Persian Green Bean Stew with Chicken",
    "description": "Traditional Persian stew: e Loobia Sabz - Persian Green Bean Stew with Chicken",
    "ingredients": [
      "2 pounds chicken breast or lamb, cut into cubes",
      "2 pounds green beans, ends removed, cut into 2-inch pieces",
      "1 large yellow onion, finely chopped",
      "3 large garlic cloves, minced",
      "1 can (15-ounce) tomato sauce",
      "1 large ripe red tomato, peeled, seeded, finely chopped",
      "1/2 teaspoon turmeric powder",
      "1/4 teaspoon cumin powder",
      "1/4 teaspoon cinnamon",
      "1/4 teaspoon red pepper",
      "2 tablespoons lime juice"
    ],
    "steps": [
      "Heat 2 tablespoons of oil in a large saucepan over medium heat, add the chopped onion, saute until soft.\nAdd the minced garlic and saute for another 2-3 minutes. Add turmeric, stir well.\nAdd the chicken pieces, salt, pepper, cumin, and crushed red pepper, cook until the chicken is no longer pink.\nAdd the chopped tomatoes and the tomato sauce, mix well. Add enough water to cover. Bring to a boil for a few minutes. Reduce heat, cover, and cook on low heat for 45-50 minutes.\nIn the meantime in a large frying pan saute the green beans lightly for a couple of minutes in 2 tablespoons of oil over medium heat.\nAdd the beans to the pan, add cinnamon, pour in the lime juice, add additional hot water if necessary, taste, and adjust the seasoning. Cover and cook for another 15-20 minutes on low heat until the chicken pieces and green beans are tender, most water evaporated and the tomato sauce thickened.",
      "Serve hot with polow, mast o khiar, torshi, and sabzi khordan."
    ],
    "minutes": 3,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2013/09/khoresh-e-loobia-sabz-persian-green.html"
  },
  {
    "id": "turmeric_4b385129",
    "name": "Persian Rhubarb Stew",
    "description": "Traditional Persian stew: Persian Rhubarb Stew",
    "ingredients": [
      "5 stalks of rhubarb--washed, dried and cut into small bite-sized pieces",
      "1-1/2 pounds of meat (lamb, beef or chicken), washed and cubed",
      "1 large onion-- peeled, finely chopped",
      "1-2 garlic cloves, minced",
      "1 bunch of parsley-- remove the thick stems, wash and chop (makes about 2 cups, packed)",
      "1 bunch of mint, leaves only, wash and chop (makes about 1 cup, packed)",
      "1/2 teaspoon turmeric",
      "1 tablespoon, liquid saffron",
      "1 tablespoon sugar or to taste *optional"
    ],
    "steps": [
      "In a pan, heat 2-3 tablespoons of oil, saute chopped onions until translucent. Add garlic and turmeric, stir, add the meat and brown on all sides. Add salt, pepper and saffron. Pour enough water to cover the meat by couple of inches. Cover and cook for an hour on medium to low heat.\n In a medium-sized frying pan, saute the chopped parsley and mint together in 2 tablespoons of oil over medium heat. Combine the parsley and mint mixture with the meat sauce half way through the cooking. Add water if necessary.\nLightly saute sliced rhubarbs in 2 tablespoons of olive oil for 2-3 minutes on medium heat. Add the rhubarb to the pot, lower the heat to a gentle simmer and cook for about 10 minutes.\nTaste and add a tablespoon of sugar or to taste, gently stir and cook for an additional 5 minutes."
    ],
    "minutes": 3,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "http://turmericsaffron.blogspot.com/2010/07/khoresh-rivas-persian-rhubarb-stew.html"
  },
  {
    "id": "turmeric_2cd42fbc",
    "name": "e Torsh - Sour Chicken Stew with Fresh Herbs and Yellow Split Peas",
    "description": "Traditional Persian stew: e Torsh - Sour Chicken Stew with Fresh Herbs and Yellow Split Peas",
    "ingredients": [
      "Seville orange/bitter orange"
    ],
    "steps": [
      "Clean and wash all fresh vegetables, remove the stems and chop finely.\nIn a skillet add 2-3 tablespoons of vegetable oil, saute the chopped onion, minced garlic and the chopped vegetables on medium-low heat until soft and tender.\nCook the yellow split peas in 2 cups of water with a dash of salt for about 30 minutes or until they become soft. Discard the water.\nLightly fry the chicken pieces in a couple of tablespoons of oil in a frying pan on medium heat until they are no longer pink, add salt and pepper to taste. As I mentioned, I added a pinch of turmeric as well.\nIn a saucepan combine all the ingredients, the sauteed vegetable mixture, chicken pieces and the yellow split peas. Add enough water to cover all the ingredients. Bring to a boil on medium-high heat. Reduce heat, add salt and pepper and the juice of Seville orange or lemon juice to your liking. Cover and cook on medium-low heat for about an hour until all the flavors come together, stirring occasionally. Taste and adjust the seasoning."
    ],
    "minutes": 30,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2011/10/morgh-e-torsh-sour-chicken-stew-with.html"
  },
  {
    "id": "turmeric_801dbb65",
    "name": "Celery Stew",
    "description": "Traditional Persian stew: Celery Stew",
    "ingredients": [
      "1 pound beef or lamb, washed and cut into cubes-1 large onion, peeled and chopped-1 head of celery, washed, cut into 1-inch pieces-2 bunches fresh flat-leaf parsley, finely chopped -1 bunch fresh mint, finely chopped, or 2-3 tablespoons dried mint-2 large garlic cloves, minced-2-3 tablespoons freshly squeezed lemon juice (adjust to taste) -1/2 teaspoon turmeric-Salt and pepper, to taste-Vegetable oil"
    ],
    "steps": [
      "In a large pot, heat 3 tablespoons of oil over medium-high heat. Add chopped onions and cook until golden. Stir in the minced garlic and saute for 2-3 minutes more. \nAdd turmeric and the meat to the pot, and brown the meat on all sides. Season with salt and pepper.  \nPour in 2-3 cups of water, bring to a boil, then reduce the heat to medium-low, cover, and cook for about 30-40 minutes.\nIn a large frying pan, heat 2-3 tablespoons of oil over medium-high heat. Sauté the celery pieces until softened. Add the parsley and mint; stir well and sauté for another 4-5 minutes.\nAdd the sauteed vegetables to the pot with the meat. Adjust seasoning and water level, if necessary. Cover and simmer for 1 1/2 hours, until the meat is tender.\nStir in lemon juice toward the end of cooking."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2009/05/celery-stew-khoresh-karafs.html"
  },
  {
    "id": "turmeric_88a7194c",
    "name": "Khoresh Gheymeh: A Traditional Iranian Dish with Meat and Yellow Split Peas",
    "description": "Traditional Persian stew: Khoresh Gheymeh: A Traditional Iranian Dish with Meat and Yellow Split Peas",
    "ingredients": [
      "2 pounds of lamb or beef, rinsed and cut into small pieces-1 cup yellow split peas, picked over and washed.-1 large onion, peeled and chopped -2-3 tablespoons tomato paste -4-5 dried limes (limoo amani), soaked for 5 minutes, then pierced with a fork.-1/2 teaspoon turmeric-A pinch of cinnamon-1 teaspoon rosewater *optional-Salt and pepper to taste-Vegetable oil-2 large potatoes, peeled, sliced, and fried for topping"
    ],
    "steps": [
      "Heat 1 tablespoon of oil in a small saucepan over medium heat. Add tomato paste and saute for 2-3 minutes, stirring frequently, until it darkens slightly. Set aside.\nIn a large pot, heat 3 tablespoons of oil over medium heat. Add the onions and saute until translucent. Stir in the turmeric and cook for another minute. Add the meat and brown it on all sides. Season with salt, pepper, and a pinch of cinnamon.  \nStir in the yellow split peas and saute for about 5 minutes. Add the tomato paste and mix well. \nPour in enough water to cover the ingredients by 1-2 inches. Add the dried limes. Bring to a boil, then reduce the heat, cover, and simmer for about 1 1/2 to 2 hours or until the meat is tender.  Add water if needed and adjust seasoning to taste. \nThe split peas should be tender but still hold their shape. To ensure this, you can parboil them separately until just tender and add them during the last 30-40 minutes of cooking.\nIn the last ten minutes, stir in the rosewater if using."
    ],
    "minutes": 120,
    "nutrition": {
      "calories": 400,
      "protein": 30,
      "carbohydrates": 35,
      "fat": 18
    },
    "tags": [
      "Persian",
      "Stew",
      "Traditional",
      "Khoresh"
    ],
    "cuisine": [
      "Persian",
      "Iranian",
      "Middle Eastern"
    ],
    "difficulty": "Medium",
    "primary_category": "Stew",
    "health_score": 80,
    "source_url": "https://turmericsaffron.blogspot.com/2010/03/khoresh-ghaymeh-traditional-iranian.html"
  }
]